STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_ca35.h
/*
 * @brief  (DTS)
 */
typedef struct
{
       uint32_t RESERVED15[4];    /*!< Reserved                                Address offset: 0x000-0x00C */
  __IO uint32_t PVTREG_LOCK;      /*!< DTS PVT register lock register          Address offset: 0x010 */
  __IO uint32_t PVTLOCK_SR;       /*!< DTS PVT lock status register            Address offset: 0x014 */
       uint32_t RESERVED0[2];     /*!< Reserved                                Address offset: 0x018-0x01C */
  __IO uint32_t PVTTMR_CR;        /*!< DTS PVT Timer control register          Address offset: 0x020 */
  __IO uint32_t PVTTMR_SR;        /*!< DTS PVT timer status register           Address offset: 0x024 */
  __IO uint32_t PVTTMR_ICR;       /*!< DTS PVT timer IRQ clear register        Address offset: 0x028 */
  __IO uint32_t PVTTMRIRQTESTR;   /*!< DTS PVT timer IRQ test register         Address offset: 0x02C */
       uint32_t RESERVED1[4];     /*!< Reserved                                Address offset: 0x030-0x03C */
  __IO uint32_t PVT_IER;          /*!< DTS PVT IRQ enable register             Address offset: 0x040 */
       uint32_t RESERVED2[3];     /*!< Reserved                                Address offset: 0x044-0x04C */
  __IO uint32_t PVTIRQTRMASKR;    /*!< DTS PVT IRQ timer mask register         Address offset: 0x050 */
  __IO uint32_t TS_MR;            /*!< DTS PVT IRQ TS mask register            Address offset: 0x054 */
       uint32_t RESERVED3[2];     /*!< Reserved                                Address offset: 0x058-0x05C */
  __IO uint32_t PVTTR_SR;         /*!< DTS PVT IRQ timer status register       Address offset: 0x060 */
  __IO uint32_t TS_ISR;           /*!< DTS PVT IRQ TS status register          Address offset: 0x064 */
       uint32_t RESERVED4[2];     /*!< Reserved                                Address offset: 0x068-0x06C */
  __IO uint32_t PVTTMRRAW_ISR;    /*!< DTS PVT IRQ timer raw status register   Address offset: 0x070 */
  __IO uint32_t TSRAW_ISR;        /*!< DTS PVT IRQ TS raw status register      Address offset: 0x074 */
       uint32_t RESERVED5[2];     /*!< Reserved                                Address offset: 0x078-0x07C */
  __IO uint32_t TSCCLKSYNTHR;     /*!< DTS TSC clock synthesizer register      Address offset: 0x080 */
  __IO uint32_t TSCSDIFDISABLER;  /*!< DTS TSC SDIF interface disable register Address offset: 0x084 */
  __IO uint32_t TSCSDIF_SR;       /*!< DTS TSC SDIF status register            Address offset: 0x088 */
  __IO uint32_t TSCSDIF_CR;       /*!< DTS TSC SDIF register                   Address offset: 0x08C */
  __IO uint32_t TSCSDIFHALTR;     /*!< DTS TSC SDIF halt register              Address offset: 0x090 */
  __IO uint32_t TSCSDIF_CFGR;     /*!< DTS TSC SDIF control register           Address offset: 0x094 */
       uint32_t RESERVED6[2];     /*!< Reserved                                Address offset: 0x098-0x09C */
  __IO uint32_t TSCSMPL_CR;       /*!< DTS TSC sample control register         Address offset: 0x0A0 */
  __IO uint32_t TSCSDIFSMPLCLRR;  /*!< DTS TSC sample clear register           Address offset: 0x0A8 */
  __IO uint32_t TSCSMPLCNTR;      /*!< DTS TSC sample count register           Address offset: 0x0AC */
       uint32_t RESERVED7;        /*!< Reserved                                Address offset: 0x0A4 */
       uint32_t RESERVED8[4];     /*!< Reserved                                Address offset: 0x0B0-0x0BC */
  __IO uint32_t TS0_IER;          /*!< DTS TS0 IRQ enable register             Address offset: 0x0C0 */
  __IO uint32_t TS0_ISR;          /*!< DTS TS0 IRQ status register             Address offset: 0x0C4 */
  __IO uint32_t TS0_ICR;          /*!< DTS TS0 IRQ clear register              Address offset: 0x0C8 */
  __IO uint32_t TS0IRQTESTR;      /*!< DTS TS0 IRQ test register               Address offset: 0x0CC */
  __IO uint32_t TS0SDIFRDATAR;    /*!< DTS TS0 SDIF RDATA register             Address offset: 0x0D0 */
  __IO uint32_t TS0SDIFDONER;     /*!< DTS TS0 SDIF done register              Address offset: 0x0D4 */
  __IO uint32_t TS0SDIFDATAR;     /*!< DTS TS0 SDIF data register              Address offset: 0x0D8 */
       uint32_t RESERVED9;        /*!< Reserved                                Address offset: 0x0DC */
  __IO uint32_t TS0ALARMA_CFGR;   /*!< DTS TS0 alarm A configuration register  Address offset: 0x0E0 */
  __IO uint32_t TS0ALARMB_CFGR;   /*!< DTS TS0 alarm B configuration register  Address offset: 0x0E4 */
  __IO uint32_t TS0HLSAMPLER;     /*!< DTS TS0 high/low sample register        Address offset: 0x0E8 */
  __IO uint32_t TS0HILORESETR;    /*!< DTS TS0 high/low reset register         Address offset: 0x0EC */
       uint32_t RESERVED11[4];    /*!< Reserved                                Address offset: 0x0F0-0x0FC */
  __IO uint32_t TS1_IER;          /*!< DTS TS1 IRQ enable register             Address offset: 0x100 */
  __IO uint32_t TS1_ISR;          /*!< DTS TS1 IRQ status register             Address offset: 0x104 */
  __IO uint32_t TS1_ICR;          /*!< DTS TS1 IRQ clear register              Address offset: 0x108 */
  __IO uint32_t TS1IRQTESTR;      /*!< DTS TS1 IRQ test register               Address offset: 0x10C */
  __IO uint32_t TS1SDIFRDATAR;    /*!< DTS TS1 SDIF RDATA register             Address offset: 0x110 */
  __IO uint32_t TS1SDIFDONER;     /*!< DTS TS1 SDIF done register              Address offset: 0x114 */
  __IO uint32_t TS1SDIFDATAR;     /*!< DTS TS1 SDIF data register              Address offset: 0x118 */
       uint32_t RESERVED12;       /*!< Reserved                                Address offset: 0x11C */
  __IO uint32_t TS1ALARMA_CFGR;   /*!< DTS TS1 alarm A configuration register  Address offset: 0x120 */
       uint32_t RESERVED13;       /*!< Reserved                                Address offset: 0x124 */
  __IO uint32_t TS1HLSAMPLER;     /*!< DTS TS1 high/low sample register        Address offset: 0x128 */
  __IO uint32_t TS1HILORESETR;    /*!< DTS TS1 high/low reset register         Address offset: 0x12C */
} DTS_TypeDef;

