STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_ca35.h
  __IO uint32_t DMAC0RXIWTR;      /*!< Channel 0 Rx interrupt watchdog timer register             Address offset: 0x1138 */
  __IO uint32_t DMAC0SFCSR;       /*!< Channel 0 slot function control status register            Address offset: 0x113C */
       uint32_t RESERVED49;       /*!< Reserved                                                   Address offset: 0x1140 */
  __IO uint32_t DMAC0CATXDR;      /*!< Channel 0 current application transmit descriptor register Address offset: 0x1144 */
       uint32_t RESERVED50;       /*!< Reserved                                                   Address offset: 0x1148 */
  __IO uint32_t DMAC0CARXDR;      /*!< Channel 0 current application receive descriptor register  Address offset: 0x114C */
       uint32_t RESERVED51;       /*!< Reserved                                                   Address offset: 0x1150 */
  __IO uint32_t DMAC0CATXBR;      /*!< Channel 0 current application transmit buffer register     Address offset: 0x1154 */
       uint32_t RESERVED52;       /*!< Reserved                                                   Address offset: 0x1158 */
  __IO uint32_t DMAC0CARXBR;      /*!< Channel 0 current application receive buffer register      Address offset: 0x115C */
  __IO uint32_t DMAC0SR;          /*!< Channel 0 status register                                  Address offset: 0x1160 */
  __IO uint32_t DMAC0MFCR;        /*!< Channel 0 missed frame count register                      Address offset: 0x1164 */
       uint32_t RESERVED53[6];    /*!< Reserved                                                   Address offset: 0x1168-0x117C */
  __IO uint32_t DMAC1CR;          /*!< Channel 1 control register                                 Address offset: 0x1180 */
  __IO uint32_t DMAC1TXCR;        /*!< Channel 1 transmit control register                        Address offset: 0x1184 */
       uint32_t RESERVED54[3];    /*!< Reserved                                                   Address offset: 0x1188-0x1190 */
  __IO uint32_t DMAC1TXDLAR;      /*!< Channel 1 Tx descriptor list address register              Address offset: 0x1194 */
       uint32_t RESERVED55[2];    /*!< Reserved                                                   Address offset: 0x1198-0x119C */
  __IO uint32_t DMAC1TXDTPR;      /*!< Channel 1 Tx descriptor tail pointer register              Address offset: 0x11A0 */
       uint32_t RESERVED56[2];    /*!< Reserved                                                   Address offset: 0x11A4-0x11A8 */
  __IO uint32_t DMAC1TXRLR;       /*!< Channel 1 Tx descriptor ring length register               Address offset: 0x11AC */
       uint32_t RESERVED57;       /*!< Reserved                                                   Address offset: 0x11B0 */
  __IO uint32_t DMAC1IER;         /*!< Channel 1 interrupt enable register                        Address offset: 0x11B4 */
       uint32_t RESERVED58;       /*!< Reserved                                                   Address offset: 0x11B8 */
  __IO uint32_t DMAC1SFCSR;       /*!< Channel 1 slot function control status register            Address offset: 0x11BC */
       uint32_t RESERVED59;       /*!< Reserved                                                   Address offset: 0x11C0 */
  __IO uint32_t DMAC1CATXDR;      /*!< Channel 1 current application transmit descriptor register Address offset: 0x11C4 */
       uint32_t RESERVED60[3];    /*!< Reserved                                                   Address offset: 0x11C8-0x11D0 */
  __IO uint32_t DMAC1CATXBR;      /*!< Channel 1 current application transmit buffer register     Address offset: 0x11D4 */
       uint32_t RESERVED61[2];    /*!< Reserved                                                   Address offset: 0x11D8-0x11DC */
  __IO uint32_t DMAC1SR;          /*!< Channel 1 status register                                  Address offset: 0x11E0 */
  __IO uint32_t DMAC1MFCR;        /*!< Channel 1 missed frame count register                      Address offset: 0x11E4 */
} ETH_TypeDef;

/*
 * @brief EXTI Block description (EXTI)
 * c7amba_exti_v3-0_UserSpec_v3_0_0m *
 */
typedef struct
{
  __IO uint32_t RTSR1;           /*!< EXTI rising trigger selection register        Address offset: 0x000 */
  __IO uint32_t FTSR1;           /*!< EXTI falling trigger selection register       Address offset: 0x004 */
  __IO uint32_t SWIER1;          /*!< EXTI software interrupt event register        Address offset: 0x008 */
  __IO uint32_t RPR1;            /*!< EXTI rising edge pending register             Address offset: 0x00C */
  __IO uint32_t FPR1;            /*!< EXTI falling edge pending register            Address offset: 0x010 */
  __IO uint32_t SECCFGR1;        /*!< EXTI security configuration register          Address offset: 0x014 */
  __IO uint32_t PRIVCFGR1;       /*!< EXTI Privilege configuration register         Address offset: 0x018 */
       uint32_t RESERVED0;       /*!< Reserved                                      Address offset: 0x01C */
  __IO uint32_t RTSR2;           /*!< EXTI rising trigger selection register        Address offset: 0x020 */
  __IO uint32_t FTSR2;           /*!< EXTI falling trigger selection register       Address offset: 0x024 */
  __IO uint32_t SWIER2;          /*!< EXTI software interrupt event register        Address offset: 0x028 */
  __IO uint32_t RPR2;            /*!< EXTI rising edge pending register             Address offset: 0x02C */
  __IO uint32_t FPR2;            /*!< EXTI falling edge pending register            Address offset: 0x030 */
  __IO uint32_t SECCFGR2;        /*!< EXTI security enable register                 Address offset: 0x034 */
  __IO uint32_t PRIVCFGR2;       /*!< EXTI Privilege enable register                Address offset: 0x038 */
       uint32_t RESERVED1;       /*!< Reserved                                       Address offset: 0x03C */
  __IO uint32_t RTSR3;           /*!< EXTI rising trigger selection register        Address offset: 0x040 */
  __IO uint32_t FTSR3;           /*!< EXTI falling trigger selection register       Address offset: 0x044 */
  __IO uint32_t SWIER3;          /*!< EXTI software interrupt event register        Address offset: 0x048 */
  __IO uint32_t RPR3;            /*!< EXTI rising edge pending register             Address offset: 0x04C */
  __IO uint32_t FPR3;            /*!< EXTI falling edge pending register            Address offset: 0x050 */
  __IO uint32_t SECCFGR3;        /*!< EXTI security enable register                 Address offset: 0x054 */
  __IO uint32_t PRIVCFGR3;       /*!< EXTI Privilege enable register                Address offset: 0x058 */
       uint32_t RESERVED15;      /*!< Reserved                                       Address offset: 0x05C */
  __IO uint32_t EXTICR[4];       /*!< EXTI external interrupt selection register 1  Address offset: 0x060-0x6C */
  __IO uint32_t LOCKR;           /*!< EXTI lock register                            Address offset: 0x070 */
       uint32_t RESERVED3[3];    /*!< Reserved                                       Address offset: 0x074-0x07C */
  __IO uint32_t C1IMR1;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x080 */
       uint32_t RESERVED17[3];   /*!< Reserved                                       Address offset: 0x088-0x08C */
  __IO uint32_t C1IMR2;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x090 */
       uint32_t RESERVED18[3];   /*!< Reserved                                       Address offset: 0x098-0x09C */
  __IO uint32_t C1IMR3;          /*!< EXTI CPU1 wakeup with interrupt mask register Address offset: 0x0A0 */
       uint32_t RESERVED6[7];    /*!< Reserved                                       Address offset: 0x0A8-0x0BC */
  __IO uint32_t C2IMR1;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0C0 */
  __IO uint32_t C2EMR1;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0C4 */
       uint32_t RESERVED20[2];   /*!< Reserved                                       Address offset: 0x0C8-0x0CC */
  __IO uint32_t C2IMR2;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0D0 */
  __IO uint32_t C2EMR2;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0D4 */
       uint32_t RESERVED21[2];   /*!< Reserved                                       Address offset: 0x0D8-0x0DC */
  __IO uint32_t C2IMR3;          /*!< EXTI CPU2 wakeup with interrupt mask register Address offset: 0x0E0 */
  __IO uint32_t C2EMR3;          /*!< EXTI CPU2 wakeup with event mask register     Address offset: 0x0E4 */
         uint32_t RESERVED22[6];   /*!< Reserved                                       Address offset: 0x0E8-0x0FC */
  __IO uint32_t C3IMR1;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x100 */
  __IO uint32_t C3EMR1;          /*!< EXTI CPU3 wakeup with event mask register     Address offset: 0x104 */
       uint32_t RESERVED23[2];   /*!< Reserved                                       Address offset: 0x108-0x10C */
  __IO uint32_t C3IMR2;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x110 */
  __IO uint32_t C3EMR2;          /*!< EXTI CPU3 wakeup with event mask register     Address offset: 0x114 */
       uint32_t RESERVED24[2];   /*!< Reserved                                       Address offset: 0x118-0x11C */
  __IO uint32_t C3IMR3;          /*!< EXTI CPU3 wakeup with interrupt mask register Address offset: 0x120 */
       uint32_t RESERVED25[23];  /*!< Reserved                                       Address offset: 0x124-0x17C */
  __IO uint32_t ECIDCFGR[96];    /*!< EXTI configurable event CID Config register   Address offset: 0x180-0x2BC */
  __IO uint32_t C1CIDCFGR;       /*!< EXTI processor 1 CID configuration register   Address offset: 0x300 */
  __IO uint32_t C2CIDCFGR;       /*!< EXTI processor 2 CID configuration register   Address offset: 0x304 */
  __IO uint32_t C3CIDCFGR;       /*!< EXTI processor 3 CID configuration register   Address offset: 0x308 */
       uint32_t RESERVED27[45];  /*!< Reserved                                      Address offset: 0x30C-0x3BC */
  __IO uint32_t HWCFGR13;        /*!< EXTI Hardware configuration register 13       Address offset: 0x3C0 */
  __IO uint32_t HWCFGR12;        /*!< EXTI Hardware configuration register 12       Address offset: 0x3C4 */
  __IO uint32_t HWCFGR11;        /*!< EXTI Hardware configuration register 11       Address offset: 0x3C8 */
       uint32_t RESERVED12[3];   /*!< Reserved                                      Address offset: 0x3CC-0x3D4 */
  __IO uint32_t HWCFGR7;         /*!< EXTI Hardware configuration register 7        Address offset: 0x3D8 */
  __IO uint32_t HWCFGR6;         /*!< EXTI Hardware configuration register 6        Address offset: 0x3DC */
  __IO uint32_t HWCFGR5;         /*!< EXTI Hardware configuration register 5        Address offset: 0x3E0 */
  __IO uint32_t HWCFGR4;         /*!< EXTI Hardware configuration register 4        Address offset: 0x3E4 */
  __IO uint32_t HWCFGR3;         /*!< EXTI Hardware configuration register 3        Address offset: 0x3E8 */
  __IO uint32_t HWCFGR2;         /*!< EXTI Hardware configuration register 2        Address offset: 0x3EC */
  __IO uint32_t HWCFGR1;         /*!< EXTI Hardware configuration register 1        Address offset: 0x3F0 */
  __IO uint32_t VERR;            /*!< EXTI IP Version register                      Address offset: 0x3F4 */
  __IO uint32_t IPIDR;           /*!< EXTI Identification register                  Address offset: 0x3F8 */
  __IO uint32_t SIDR;            /*!< EXTI Size ID register                         Address offset: 0x3FC */
} EXTI_TypeDef;

typedef struct
{
  __IO uint32_t IMR1;                /*!< EXTI Interrupt mask register,                Address offset: 0x00 */
  __IO uint32_t EMR1;                /*!< EXTI Event mask register,                    Address offset: 0x04 */
  uint32_t      RESERVED1[2];        /*!< Reserved, offset 0x08 -> 0x10                                     */
  __IO uint32_t IMR2;                /*!< EXTI Interrupt mask register,                Address offset: 0x10 */
  __IO uint32_t EMR2;                /*!< EXTI Event mask register,                    Address offset: 0x14 */
  uint32_t      RESERVED2[2];        /*!< Reserved, offset 0x18 -> 0x20                                     */
  __IO uint32_t IMR3;                /*!< EXTI Interrupt mask register,                Address offset: 0x20 */
  __IO uint32_t EMR3;                /*!< EXTI Event mask register,                    Address offset: 0x24 */
  uint32_t      RESERVED3[6];        /*!< Reserved, offset 0x28 -> 0x40                                     */
} EXTI_Core_TypeDef;

/**
  * @brief FD Controller Area Network
  */

typedef struct
{
  __IO uint32_t CREL;         /*!< FDCAN Core Release register,                                     Address offset: 0x000 */
  __IO uint32_t ENDN;         /*!< FDCAN Endian register,                                           Address offset: 0x004 */
  __IO uint32_t RESERVED1;    /*!< Reserved,                                                                        0x008 */
  __IO uint32_t DBTP;         /*!< FDCAN Data Bit Timing & Prescaler register,                      Address offset: 0x00C */
  __IO uint32_t TEST;         /*!< FDCAN Test register,                                             Address offset: 0x010 */
  __IO uint32_t RWD;          /*!< FDCAN RAM Watchdog register,                                     Address offset: 0x014 */
  __IO uint32_t CCCR;         /*!< FDCAN CC Control register,                                       Address offset: 0x018 */
  __IO uint32_t NBTP;         /*!< FDCAN Nominal Bit Timing & Prescaler register,                   Address offset: 0x01C */
  __IO uint32_t TSCC;         /*!< FDCAN Timestamp Counter Configuration register,                  Address offset: 0x020 */
  __IO uint32_t TSCV;         /*!< FDCAN Timestamp Counter Value register,                          Address offset: 0x024 */
  __IO uint32_t TOCC;         /*!< FDCAN Timeout Counter Configuration register,                    Address offset: 0x028 */
  __IO uint32_t TOCV;         /*!< FDCAN Timeout Counter Value register,                            Address offset: 0x02C */
  __IO uint32_t RESERVED2[4]; /*!< Reserved,                                                                0x030 - 0x03C */
  __IO uint32_t ECR;          /*!< FDCAN Error Counter register,                                    Address offset: 0x040 */
  __IO uint32_t PSR;          /*!< FDCAN Protocol Status register,                                  Address offset: 0x044 */
  __IO uint32_t TDCR;         /*!< FDCAN Transmitter Delay Compensation register,                   Address offset: 0x048 */
  __IO uint32_t RESERVED3;    /*!< Reserved,                                                                        0x04C */
  __IO uint32_t IR;           /*!< FDCAN Interrupt register,                                        Address offset: 0x050 */
  __IO uint32_t IE;           /*!< FDCAN Interrupt Enable register,                                 Address offset: 0x054 */
  __IO uint32_t ILS;          /*!< FDCAN Interrupt Line Select register,                            Address offset: 0x058 */
  __IO uint32_t ILE;          /*!< FDCAN Interrupt Line Enable register,                            Address offset: 0x05C */
  __IO uint32_t RESERVED4[8]; /*!< Reserved,                                                                0x060 - 0x07C */
  __IO uint32_t GFC;          /*!< FDCAN Global Filter Configuration register,                      Address offset: 0x080 */
  __IO uint32_t SIDFC;        /*!< FDCAN Standard ID Filter Configuration register,                 Address offset: 0x084 */
  __IO uint32_t XIDFC;        /*!< FDCAN Extended ID Filter Configuration register,                 Address offset: 0x088 */
  __IO uint32_t RESERVED5;    /*!< Reserved,                                                                        0x08C */
  __IO uint32_t XIDAM;        /*!< FDCAN Extended ID AND Mask register,                             Address offset: 0x090 */
  __IO uint32_t HPMS;         /*!< FDCAN High Priority Message Status register,                     Address offset: 0x094 */
  __IO uint32_t NDAT1;        /*!< FDCAN New Data 1 register,                                       Address offset: 0x098 */
  __IO uint32_t NDAT2;        /*!< FDCAN New Data 2 register,                                       Address offset: 0x09C */
  __IO uint32_t RXF0C;        /*!< FDCAN Rx FIFO 0 Configuration register,                          Address offset: 0x0A0 */
  __IO uint32_t RXF0S;        /*!< FDCAN Rx FIFO 0 Status register,                                 Address offset: 0x0A4 */
  __IO uint32_t RXF0A;        /*!< FDCAN Rx FIFO 0 Acknowledge register,                            Address offset: 0x0A8 */
  __IO uint32_t RXBC;         /*!< FDCAN Rx Buffer Configuration register,                          Address offset: 0x0AC */
  __IO uint32_t RXF1C;        /*!< FDCAN Rx FIFO 1 Configuration register,                          Address offset: 0x0B0 */
  __IO uint32_t RXF1S;        /*!< FDCAN Rx FIFO 1 Status register,                                 Address offset: 0x0B4 */
  __IO uint32_t RXF1A;        /*!< FDCAN Rx FIFO 1 Acknowledge register,                            Address offset: 0x0B8 */
  __IO uint32_t RXESC;        /*!< FDCAN Rx Buffer/FIFO Element Size Configuration register,        Address offset: 0x0BC */
  __IO uint32_t TXBC;         /*!< FDCAN Tx Buffer Configuration register,                          Address offset: 0x0C0 */
  __IO uint32_t TXFQS;        /*!< FDCAN Tx FIFO/Queue Status register,                             Address offset: 0x0C4 */
  __IO uint32_t TXESC;        /*!< FDCAN Tx Buffer Element Size Configuration register,             Address offset: 0x0C8 */
  __IO uint32_t TXBRP;        /*!< FDCAN Tx Buffer Request Pending register,                        Address offset: 0x0CC */
  __IO uint32_t TXBAR;        /*!< FDCAN Tx Buffer Add Request register,                            Address offset: 0x0D0 */
  __IO uint32_t TXBCR;        /*!< FDCAN Tx Buffer Cancellation Request register,                   Address offset: 0x0D4 */
  __IO uint32_t TXBTO;        /*!< FDCAN Tx Buffer Transmission Occurred register,                  Address offset: 0x0D8 */
  __IO uint32_t TXBCF;        /*!< FDCAN Tx Buffer Cancellation Finished register,                  Address offset: 0x0DC */
  __IO uint32_t TXBTIE;       /*!< FDCAN Tx Buffer Transmission Interrupt Enable register,          Address offset: 0x0E0 */
  __IO uint32_t TXBCIE;       /*!< FDCAN Tx Buffer Cancellation Finished Interrupt Enable register, Address offset: 0x0E4 */
  __IO uint32_t RESERVED6[2]; /*!< Reserved,                                                                0x0E8 - 0x0EC */
  __IO uint32_t TXEFC;        /*!< FDCAN Tx Event FIFO Configuration register,                      Address offset: 0x0F0 */
  __IO uint32_t TXEFS;        /*!< FDCAN Tx Event FIFO Status register,                             Address offset: 0x0F4 */
  __IO uint32_t TXEFA;        /*!< FDCAN Tx Event FIFO Acknowledge register,                        Address offset: 0x0F8 */
  __IO uint32_t RESERVED7;    /*!< Reserved,                                                                        0x0FC */
} FDCAN_GlobalTypeDef;

/**
  * @brief TTFD Controller Area Network
  */

typedef struct
{
  __IO uint32_t TTTMC;          /*!< TT Trigger Memory Configuration register,    Address offset: 0x100 */
  __IO uint32_t TTRMC;          /*!< TT Reference Message Configuration register, Address offset: 0x104 */
  __IO uint32_t TTOCF;          /*!< TT Operation Configuration register,         Address offset: 0x108 */
  __IO uint32_t TTMLM;          /*!< TT Matrix Limits register,                   Address offset: 0x10C */
  __IO uint32_t TURCF;          /*!< TUR Configuration register,                  Address offset: 0x110 */
  __IO uint32_t TTOCN;          /*!< TT Operation Control register,               Address offset: 0x114 */
  __IO uint32_t TTGTP;          /*!< TT Global Time Preset register,              Address offset: 0x118 */
  __IO uint32_t TTTMK;          /*!< TT Time Mark register,                       Address offset: 0x11C */
  __IO uint32_t TTIR;           /*!< TT Interrupt register,                       Address offset: 0x120 */
  __IO uint32_t TTIE;           /*!< TT Interrupt Enable register,                Address offset: 0x124 */
  __IO uint32_t TTILS;          /*!< TT Interrupt Line Select register,           Address offset: 0x128 */
  __IO uint32_t TTOST;          /*!< TT Operation Status register,                Address offset: 0x12C */
  __IO uint32_t TURNA;          /*!< TT TUR Numerator Actual register,            Address offset: 0x130 */
  __IO uint32_t TTLGT;          /*!< TT Local and Global Time register,           Address offset: 0x134 */
  __IO uint32_t TTCTC;          /*!< TT Cycle Time and Count register,            Address offset: 0x138 */
  __IO uint32_t TTCPT;          /*!< TT Capture Time register,                    Address offset: 0x13C */
  __IO uint32_t TTCSM;          /*!< TT Cycle Sync Mark register,                 Address offset: 0x140 */
  __IO uint32_t RESERVED1[111]; /*!< Reserved,                                            0x144 - 0x2FC */
  __IO uint32_t TTTS;           /*!< TT Trigger Select register,                  Address offset: 0x300 */
} TTCAN_TypeDef;

/**
  * @brief FD Controller Area Network
  */

typedef struct
{
  __IO uint32_t CREL;  /*!< Clock Calibration Unit Core Release register, Address offset: 0x00 */
  __IO uint32_t CCFG;  /*!< Calibration Configuration register,           Address offset: 0x04 */
  __IO uint32_t CSTAT; /*!< Calibration Status register,                  Address offset: 0x08 */
  __IO uint32_t CWD;   /*!< Calibration Watchdog register,                Address offset: 0x0C */
  __IO uint32_t IR;    /*!< CCU Interrupt register,                       Address offset: 0x10 */
  __IO uint32_t IE;    /*!< CCU Interrupt Enable register,                Address offset: 0x14 */
} FDCAN_ClockCalibrationUnit_TypeDef;
/**
  * @brief Flexible Memory Controller
  */

typedef struct
{
  __IO uint32_t BTCR[8];    /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */
} FMC_Bank1_TypeDef;

/**
  * @brief Flexible Memory Controller Bank1E
  */

typedef struct
{
  __IO uint32_t BWTR[7];    /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} FMC_Bank1E_TypeDef;

/**
  * @brief Flexible Memory Controller Bank3
  */

