STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_ca35.h
/*******************  Bit definition for CSI_SR0 register  ********************/
#define CSI_SR0_LB0F_Pos                (0U)
#define CSI_SR0_LB0F_Msk                (0x1U << CSI_SR0_LB0F_Pos)               /*!< 0x00000001 */
#define CSI_SR0_LB0F                    CSI_SR0_LB0F_Msk                         /*!< Line byte counter 0 flag */
#define CSI_SR0_LB1F_Pos                (1U)
#define CSI_SR0_LB1F_Msk                (0x1U << CSI_SR0_LB1F_Pos)               /*!< 0x00000002 */
#define CSI_SR0_LB1F                    CSI_SR0_LB1F_Msk                         /*!< Line byte counter 1 flag */
#define CSI_SR0_LB2F_Pos                (2U)
#define CSI_SR0_LB2F_Msk                (0x1U << CSI_SR0_LB2F_Pos)               /*!< 0x00000004 */
#define CSI_SR0_LB2F                    CSI_SR0_LB2F_Msk                         /*!< Line byte counter 2 flag */
#define CSI_SR0_LB3F_Pos                (3U)
#define CSI_SR0_LB3F_Msk                (0x1U << CSI_SR0_LB3F_Pos)               /*!< 0x00000008 */
#define CSI_SR0_LB3F                    CSI_SR0_LB3F_Msk                         /*!< Line byte counter 3 flag */
#define CSI_SR0_TIM0F_Pos               (4U)
#define CSI_SR0_TIM0F_Msk               (0x1U << CSI_SR0_TIM0F_Pos)              /*!< 0x00000010 */
#define CSI_SR0_TIM0F                   CSI_SR0_TIM0F_Msk                        /*!< Timer 0 flag */
#define CSI_SR0_TIM1F_Pos               (5U)
#define CSI_SR0_TIM1F_Msk               (0x1U << CSI_SR0_TIM1F_Pos)              /*!< 0x00000020 */
#define CSI_SR0_TIM1F                   CSI_SR0_TIM1F_Msk                        /*!< Timer 1 flag */
#define CSI_SR0_TIM2F_Pos               (6U)
#define CSI_SR0_TIM2F_Msk               (0x1U << CSI_SR0_TIM2F_Pos)              /*!< 0x00000040 */
#define CSI_SR0_TIM2F                   CSI_SR0_TIM2F_Msk                        /*!< Timer 2 flag */
#define CSI_SR0_TIM3F_Pos               (7U)
#define CSI_SR0_TIM3F_Msk               (0x1U << CSI_SR0_TIM3F_Pos)              /*!< 0x00000080 */
#define CSI_SR0_TIM3F                   CSI_SR0_TIM3F_Msk                        /*!< Timer 3 flag */
#define CSI_SR0_SOF0F_Pos               (8U)
#define CSI_SR0_SOF0F_Msk               (0x1U << CSI_SR0_SOF0F_Pos)              /*!< 0x00000100 */
#define CSI_SR0_SOF0F                   CSI_SR0_SOF0F_Msk                        /*!< Start of frame flag for virtual channel 0 */
#define CSI_SR0_SOF1F_Pos               (9U)
#define CSI_SR0_SOF1F_Msk               (0x1U << CSI_SR0_SOF1F_Pos)              /*!< 0x00000200 */
#define CSI_SR0_SOF1F                   CSI_SR0_SOF1F_Msk                        /*!< Start of frame flag for virtual channel 1 */
#define CSI_SR0_SOF2F_Pos               (10U)
#define CSI_SR0_SOF2F_Msk               (0x1U << CSI_SR0_SOF2F_Pos)              /*!< 0x00000400 */
#define CSI_SR0_SOF2F                   CSI_SR0_SOF2F_Msk                        /*!< Start of frame flag for virtual channel 2 */
#define CSI_SR0_SOF3F_Pos               (11U)
#define CSI_SR0_SOF3F_Msk               (0x1U << CSI_SR0_SOF3F_Pos)              /*!< 0x00000800 */
#define CSI_SR0_SOF3F                   CSI_SR0_SOF3F_Msk                        /*!< Start of frame flag for virtual channel 3 */
#define CSI_SR0_EOF0F_Pos               (12U)
#define CSI_SR0_EOF0F_Msk               (0x1U << CSI_SR0_EOF0F_Pos)              /*!< 0x00001000 */
#define CSI_SR0_EOF0F                   CSI_SR0_EOF0F_Msk                        /*!< End of frame flag for virtual channel 0 */
#define CSI_SR0_EOF1F_Pos               (13U)
#define CSI_SR0_EOF1F_Msk               (0x1U << CSI_SR0_EOF1F_Pos)              /*!< 0x00002000 */
#define CSI_SR0_EOF1F                   CSI_SR0_EOF1F_Msk                        /*!< End of frame flag for virtual channel 1 */
#define CSI_SR0_EOF2F_Pos               (14U)
#define CSI_SR0_EOF2F_Msk               (0x1U << CSI_SR0_EOF2F_Pos)              /*!< 0x00004000 */
#define CSI_SR0_EOF2F                   CSI_SR0_EOF2F_Msk                        /*!< End of frame flag for virtual channel 2 */
#define CSI_SR0_EOF3F_Pos               (15U)
#define CSI_SR0_EOF3F_Msk               (0x1U << CSI_SR0_EOF3F_Pos)              /*!< 0x00008000 */
#define CSI_SR0_EOF3F                   CSI_SR0_EOF3F_Msk                        /*!< End of frame flag for virtual channel 3 */
#define CSI_SR0_SPKTF_Pos               (16U)
#define CSI_SR0_SPKTF_Msk               (0x1U << CSI_SR0_SPKTF_Pos)              /*!< 0x00010000 */
#define CSI_SR0_SPKTF                   CSI_SR0_SPKTF_Msk                        /*!< Short packet flag */
#define CSI_SR0_VC0STATEF_Pos           (17U)
#define CSI_SR0_VC0STATEF_Msk           (0x1U << CSI_SR0_VC0STATEF_Pos)          /*!< 0x00020000 */
#define CSI_SR0_VC0STATEF               CSI_SR0_VC0STATEF_Msk                    /*!< Virtual channel 0 state flag */
#define CSI_SR0_VC1STATEF_Pos           (18U)
#define CSI_SR0_VC1STATEF_Msk           (0x1U << CSI_SR0_VC1STATEF_Pos)          /*!< 0x00040000 */
#define CSI_SR0_VC1STATEF               CSI_SR0_VC1STATEF_Msk                    /*!< Virtual channel 1 state flag */
#define CSI_SR0_VC2STATEF_Pos           (19U)
#define CSI_SR0_VC2STATEF_Msk           (0x1U << CSI_SR0_VC2STATEF_Pos)          /*!< 0x00080000 */
#define CSI_SR0_VC2STATEF               CSI_SR0_VC2STATEF_Msk                    /*!< Virtual channel 2 state flag */
#define CSI_SR0_VC3STATEF_Pos           (20U)
#define CSI_SR0_VC3STATEF_Msk           (0x1U << CSI_SR0_VC3STATEF_Pos)          /*!< 0x00100000 */
#define CSI_SR0_VC3STATEF               CSI_SR0_VC3STATEF_Msk                    /*!< Virtual channel 3 state flag */
#define CSI_SR0_CCFIFOFF_Pos            (21U)
#define CSI_SR0_CCFIFOFF_Msk            (0x1U << CSI_SR0_CCFIFOFF_Pos)           /*!< 0x00200000 */
#define CSI_SR0_CCFIFOFF                CSI_SR0_CCFIFOFF_Msk                     /*!< Clock changer FIFO full flag */
#define CSI_SR0_CRCERRF_Pos             (24U)
#define CSI_SR0_CRCERRF_Msk             (0x1U << CSI_SR0_CRCERRF_Pos)            /*!< 0x01000000 */
#define CSI_SR0_CRCERRF                 CSI_SR0_CRCERRF_Msk                      /*!< CRC error flag */
#define CSI_SR0_ECCERRF_Pos             (25U)
#define CSI_SR0_ECCERRF_Msk             (0x1U << CSI_SR0_ECCERRF_Pos)            /*!< 0x02000000 */
#define CSI_SR0_ECCERRF                 CSI_SR0_ECCERRF_Msk                      /*!< ECC error flag */
#define CSI_SR0_CECCERRF_Pos            (26U)
#define CSI_SR0_CECCERRF_Msk            (0x1U << CSI_SR0_CECCERRF_Pos)           /*!< 0x04000000 */
#define CSI_SR0_CECCERRF                CSI_SR0_CECCERRF_Msk                     /*!< Corrected ECC error flag */
#define CSI_SR0_IDERRF_Pos              (27U)
#define CSI_SR0_IDERRF_Msk              (0x1U << CSI_SR0_IDERRF_Pos)             /*!< 0x08000000 */
#define CSI_SR0_IDERRF                  CSI_SR0_IDERRF_Msk                       /*!< Data type ID error flag */
#define CSI_SR0_SPKTERRF_Pos            (28U)
#define CSI_SR0_SPKTERRF_Msk            (0x1U << CSI_SR0_SPKTERRF_Pos)           /*!< 0x10000000 */
#define CSI_SR0_SPKTERRF                CSI_SR0_SPKTERRF_Msk                     /*!< Short packet error flag */
#define CSI_SR0_WDERRF_Pos              (29U)
#define CSI_SR0_WDERRF_Msk              (0x1U << CSI_SR0_WDERRF_Pos)             /*!< 0x20000000 */
#define CSI_SR0_WDERRF                  CSI_SR0_WDERRF_Msk                       /*!< Watchdog error flag */
#define CSI_SR0_SYNCERRF_Pos            (30U)
#define CSI_SR0_SYNCERRF_Msk            (0x1U << CSI_SR0_SYNCERRF_Pos)           /*!< 0x40000000 */
#define CSI_SR0_SYNCERRF                CSI_SR0_SYNCERRF_Msk                     /*!< Invalid synchronization error flag */

/*******************  Bit definition for CSI_SR1 register  ********************/
#define CSI_SR1_ESOTDL0F_Pos            (0U)
#define CSI_SR1_ESOTDL0F_Msk            (0x1U << CSI_SR1_ESOTDL0F_Pos)           /*!< 0x00000001 */
#define CSI_SR1_ESOTDL0F                CSI_SR1_ESOTDL0F_Msk                     /*!< Start of transmission error flag on lane 0 */
#define CSI_SR1_ESOTSYNCDL0F_Pos        (1U)
#define CSI_SR1_ESOTSYNCDL0F_Msk        (0x1U << CSI_SR1_ESOTSYNCDL0F_Pos)       /*!< 0x00000002 */
#define CSI_SR1_ESOTSYNCDL0F            CSI_SR1_ESOTSYNCDL0F_Msk                 /*!< Start of transmission synchronization error flag on lane 0 */
#define CSI_SR1_EESCDL0F_Pos            (2U)
#define CSI_SR1_EESCDL0F_Msk            (0x1U << CSI_SR1_EESCDL0F_Pos)           /*!< 0x00000004 */
#define CSI_SR1_EESCDL0F                CSI_SR1_EESCDL0F_Msk                     /*!< D-PHY_RX lane 0 escape entry error flag */
#define CSI_SR1_ESYNCESCDL0F_Pos        (3U)
#define CSI_SR1_ESYNCESCDL0F_Msk        (0x1U << CSI_SR1_ESYNCESCDL0F_Pos)       /*!< 0x00000008 */
#define CSI_SR1_ESYNCESCDL0F            CSI_SR1_ESYNCESCDL0F_Msk                 /*!< D-PHY_RX lane 0 low power data transmission synchronization error flag */
#define CSI_SR1_ECTRLDL0F_Pos           (4U)
#define CSI_SR1_ECTRLDL0F_Msk           (0x1U << CSI_SR1_ECTRLDL0F_Pos)          /*!< 0x00000010 */
#define CSI_SR1_ECTRLDL0F               CSI_SR1_ECTRLDL0F_Msk                    /*!< D-PHY_RX lane 0 control error flag */
#define CSI_SR1_ESOTDL1F_Pos            (8U)
#define CSI_SR1_ESOTDL1F_Msk            (0x1U << CSI_SR1_ESOTDL1F_Pos)           /*!< 0x00000100 */
#define CSI_SR1_ESOTDL1F                CSI_SR1_ESOTDL1F_Msk                     /*!< Start of transmission error flag on lane 1 */
#define CSI_SR1_ESOTSYNCDL1F_Pos        (9U)
#define CSI_SR1_ESOTSYNCDL1F_Msk        (0x1U << CSI_SR1_ESOTSYNCDL1F_Pos)       /*!< 0x00000200 */
#define CSI_SR1_ESOTSYNCDL1F            CSI_SR1_ESOTSYNCDL1F_Msk                 /*!< Start of transmission synchronization error flag on lane 1 */
#define CSI_SR1_EESCDL1F_Pos            (10U)
#define CSI_SR1_EESCDL1F_Msk            (0x1U << CSI_SR1_EESCDL1F_Pos)           /*!< 0x00000400 */
#define CSI_SR1_EESCDL1F                CSI_SR1_EESCDL1F_Msk                     /*!< D-PHY_RX lane 1 escape entry error flag */
#define CSI_SR1_ESYNCESCDL1F_Pos        (11U)
#define CSI_SR1_ESYNCESCDL1F_Msk        (0x1U << CSI_SR1_ESYNCESCDL1F_Pos)       /*!< 0x00000800 */
#define CSI_SR1_ESYNCESCDL1F            CSI_SR1_ESYNCESCDL1F_Msk                 /*!< D-PHY_RX lane 1 low power data transmission synchronization error flag */
#define CSI_SR1_ECTRLDL1F_Pos           (12U)
#define CSI_SR1_ECTRLDL1F_Msk           (0x1U << CSI_SR1_ECTRLDL1F_Pos)          /*!< 0x00001000 */
#define CSI_SR1_ECTRLDL1F               CSI_SR1_ECTRLDL1F_Msk                    /*!< D-PHY_RX lane 1 control error flag */
#define CSI_SR1_ACTDL0F_Pos             (16U)
#define CSI_SR1_ACTDL0F_Msk             (0x1U << CSI_SR1_ACTDL0F_Pos)            /*!< 0x00010000 */
#define CSI_SR1_ACTDL0F                 CSI_SR1_ACTDL0F_Msk                      /*!< D-PHY_RX lane 0 High speed reception active */
#define CSI_SR1_SYNCDL0F_Pos            (17U)
#define CSI_SR1_SYNCDL0F_Msk            (0x1U << CSI_SR1_SYNCDL0F_Pos)           /*!< 0x00020000 */
#define CSI_SR1_SYNCDL0F                CSI_SR1_SYNCDL0F_Msk                     /*!< D-PHY_RX lane 0 receiver synchronization observed */
#define CSI_SR1_SKCALDL0F_Pos           (18U)
#define CSI_SR1_SKCALDL0F_Msk           (0x1U << CSI_SR1_SKCALDL0F_Pos)          /*!< 0x00040000 */
#define CSI_SR1_SKCALDL0F               CSI_SR1_SKCALDL0F_Msk                    /*!< D-PHY_RX lane 0 High speed skew calibration */
#define CSI_SR1_STOPDL0F_Pos            (19U)
#define CSI_SR1_STOPDL0F_Msk            (0x1U << CSI_SR1_STOPDL0F_Pos)           /*!< 0x00080000 */
#define CSI_SR1_STOPDL0F                CSI_SR1_STOPDL0F_Msk                     /*!< D-PHY_RX receiver data lane 0 in stop state */
#define CSI_SR1_ULPNDL0F_Pos            (20U)
#define CSI_SR1_ULPNDL0F_Msk            (0x1U << CSI_SR1_ULPNDL0F_Pos)           /*!< 0x00100000 */
#define CSI_SR1_ULPNDL0F                CSI_SR1_ULPNDL0F_Msk                     /*!< D-PHY_RX receiver Ultra low power state (not) Active on data lane 00 */
#define CSI_SR1_ACTDL1F_Pos             (22U)
#define CSI_SR1_ACTDL1F_Msk             (0x1U << CSI_SR1_ACTDL1F_Pos)            /*!< 0x00400000 */
#define CSI_SR1_ACTDL1F                 CSI_SR1_ACTDL1F_Msk                      /*!< D-PHY_RX lane 1 High speed reception active */
#define CSI_SR1_SYNCDL1F_Pos            (23U)
#define CSI_SR1_SYNCDL1F_Msk            (0x1U << CSI_SR1_SYNCDL1F_Pos)           /*!< 0x00800000 */
#define CSI_SR1_SYNCDL1F                CSI_SR1_SYNCDL1F_Msk                     /*!< D-PHY_RX lane 1 receiver synchronization observed */
#define CSI_SR1_SKCALDL1F_Pos           (24U)
#define CSI_SR1_SKCALDL1F_Msk           (0x1U << CSI_SR1_SKCALDL1F_Pos)          /*!< 0x01000000 */
#define CSI_SR1_SKCALDL1F               CSI_SR1_SKCALDL1F_Msk                    /*!< D-PHY_RX lane 1 High speed skew calibration */
#define CSI_SR1_STOPDL1F_Pos            (25U)
#define CSI_SR1_STOPDL1F_Msk            (0x1U << CSI_SR1_STOPDL1F_Pos)           /*!< 0x02000000 */
#define CSI_SR1_STOPDL1F                CSI_SR1_STOPDL1F_Msk                     /*!< D-PHY_RX receiver data lane 1 in stop state */
#define CSI_SR1_ULPNDL1F_Pos            (26U)
#define CSI_SR1_ULPNDL1F_Msk            (0x1U << CSI_SR1_ULPNDL1F_Pos)           /*!< 0x04000000 */
#define CSI_SR1_ULPNDL1F                CSI_SR1_ULPNDL1F_Msk                     /*!< D-PHY_RX receiver Ultra low power state (not) Active on data lane 1 */
#define CSI_SR1_STOPCLF_Pos             (28U)
#define CSI_SR1_STOPCLF_Msk             (0x1U << CSI_SR1_STOPCLF_Pos)            /*!< 0x10000000 */
#define CSI_SR1_STOPCLF                 CSI_SR1_STOPCLF_Msk                      /*!< D-PHY_RX receiver in stop state for the clock lane */
#define CSI_SR1_ULPNACTF_Pos            (29U)
#define CSI_SR1_ULPNACTF_Msk            (0x1U << CSI_SR1_ULPNACTF_Pos)           /*!< 0x20000000 */
#define CSI_SR1_ULPNACTF                CSI_SR1_ULPNACTF_Msk                     /*!< D-PHY_RX receiver ULP state (not) active */
#define CSI_SR1_ULPNCLF_Pos             (30U)
#define CSI_SR1_ULPNCLF_Msk             (0x1U << CSI_SR1_ULPNCLF_Pos)            /*!< 0x40000000 */
#define CSI_SR1_ULPNCLF                 CSI_SR1_ULPNCLF_Msk                      /*!< D-PHY_RX receiver Ultra-Low power state (not) on clock lane */
#define CSI_SR1_ACTCLF_Pos              (31U)
#define CSI_SR1_ACTCLF_Msk              (0x1U << CSI_SR1_ACTCLF_Pos)             /*!< 0x80000000 */
#define CSI_SR1_ACTCLF                  CSI_SR1_ACTCLF_Msk                       /*!< D-PHY_RX receiver clock active flag */

/*******************  Bit definition for CSI_FCR0 register  *******************/
#define CSI_FCR0_CLB0F_Pos              (0U)
#define CSI_FCR0_CLB0F_Msk              (0x1U << CSI_FCR0_CLB0F_Pos)             /*!< 0x00000001 */
#define CSI_FCR0_CLB0F                  CSI_FCR0_CLB0F_Msk                       /*!< Clear Line byte counter 0 flag */
#define CSI_FCR0_CLB1F_Pos              (1U)
#define CSI_FCR0_CLB1F_Msk              (0x1U << CSI_FCR0_CLB1F_Pos)             /*!< 0x00000002 */
#define CSI_FCR0_CLB1F                  CSI_FCR0_CLB1F_Msk                       /*!< Clear Line byte counter 1 flag */
#define CSI_FCR0_CLB2F_Pos              (2U)
#define CSI_FCR0_CLB2F_Msk              (0x1U << CSI_FCR0_CLB2F_Pos)             /*!< 0x00000004 */
#define CSI_FCR0_CLB2F                  CSI_FCR0_CLB2F_Msk                       /*!< Clear Line byte counter 2 flag */
#define CSI_FCR0_CLB3F_Pos              (3U)
#define CSI_FCR0_CLB3F_Msk              (0x1U << CSI_FCR0_CLB3F_Pos)             /*!< 0x00000008 */
#define CSI_FCR0_CLB3F                  CSI_FCR0_CLB3F_Msk                       /*!< Clear Line byte counter 3 flag */
#define CSI_FCR0_CTIM0F_Pos             (4U)
#define CSI_FCR0_CTIM0F_Msk             (0x1U << CSI_FCR0_CTIM0F_Pos)            /*!< 0x00000010 */
#define CSI_FCR0_CTIM0F                 CSI_FCR0_CTIM0F_Msk                      /*!< Clear Timer 0 flag */
#define CSI_FCR0_CTIM1F_Pos             (5U)
#define CSI_FCR0_CTIM1F_Msk             (0x1U << CSI_FCR0_CTIM1F_Pos)            /*!< 0x00000020 */
#define CSI_FCR0_CTIM1F                 CSI_FCR0_CTIM1F_Msk                      /*!< Clear Timer 1 flag */
#define CSI_FCR0_CTIM2F_Pos             (6U)
#define CSI_FCR0_CTIM2F_Msk             (0x1U << CSI_FCR0_CTIM2F_Pos)            /*!< 0x00000040 */
#define CSI_FCR0_CTIM2F                 CSI_FCR0_CTIM2F_Msk                      /*!< Clear Timer 2 flag */
#define CSI_FCR0_CTIM3F_Pos             (7U)
#define CSI_FCR0_CTIM3F_Msk             (0x1U << CSI_FCR0_CTIM3F_Pos)            /*!< 0x00000080 */
#define CSI_FCR0_CTIM3F                 CSI_FCR0_CTIM3F_Msk                      /*!< Clear Timer 3 flag */
#define CSI_FCR0_CSOF0F_Pos             (8U)
#define CSI_FCR0_CSOF0F_Msk             (0x1U << CSI_FCR0_CSOF0F_Pos)            /*!< 0x00000100 */
#define CSI_FCR0_CSOF0F                 CSI_FCR0_CSOF0F_Msk                      /*!< Clear Start of frame flag for virtual channel 0 */
#define CSI_FCR0_CSOF1F_Pos             (9U)
#define CSI_FCR0_CSOF1F_Msk             (0x1U << CSI_FCR0_CSOF1F_Pos)            /*!< 0x00000200 */
#define CSI_FCR0_CSOF1F                 CSI_FCR0_CSOF1F_Msk                      /*!< Clear Start of frame flag for virtual channel 1 */
#define CSI_FCR0_CSOF2F_Pos             (10U)
#define CSI_FCR0_CSOF2F_Msk             (0x1U << CSI_FCR0_CSOF2F_Pos)            /*!< 0x00000400 */
#define CSI_FCR0_CSOF2F                 CSI_FCR0_CSOF2F_Msk                      /*!< Clear Start of frame flag for virtual channel 2 */
#define CSI_FCR0_CSOF3F_Pos             (11U)
#define CSI_FCR0_CSOF3F_Msk             (0x1U << CSI_FCR0_CSOF3F_Pos)            /*!< 0x00000800 */
#define CSI_FCR0_CSOF3F                 CSI_FCR0_CSOF3F_Msk                      /*!< Clear Start of frame flag for virtual channel 3 */
#define CSI_FCR0_CEOF0F_Pos             (12U)
#define CSI_FCR0_CEOF0F_Msk             (0x1U << CSI_FCR0_CEOF0F_Pos)            /*!< 0x00001000 */
#define CSI_FCR0_CEOF0F                 CSI_FCR0_CEOF0F_Msk                      /*!< Clear End of frame flag for virtual channel 0 */
#define CSI_FCR0_CEOF1F_Pos             (13U)
#define CSI_FCR0_CEOF1F_Msk             (0x1U << CSI_FCR0_CEOF1F_Pos)            /*!< 0x00002000 */
#define CSI_FCR0_CEOF1F                 CSI_FCR0_CEOF1F_Msk                      /*!< Clear End of frame flag for virtual channel 1 */
#define CSI_FCR0_CEOF2F_Pos             (14U)
#define CSI_FCR0_CEOF2F_Msk             (0x1U << CSI_FCR0_CEOF2F_Pos)            /*!< 0x00004000 */
#define CSI_FCR0_CEOF2F                 CSI_FCR0_CEOF2F_Msk                      /*!< Clear End of frame flag for virtual channel 2 */
#define CSI_FCR0_CEOF3F_Pos             (15U)
#define CSI_FCR0_CEOF3F_Msk             (0x1U << CSI_FCR0_CEOF3F_Pos)            /*!< 0x00008000 */
#define CSI_FCR0_CEOF3F                 CSI_FCR0_CEOF3F_Msk                      /*!< Clear End of frame flag for virtual channel 3 */
#define CSI_FCR0_CSPKTF_Pos             (16U)
#define CSI_FCR0_CSPKTF_Msk             (0x1U << CSI_FCR0_CSPKTF_Pos)            /*!< 0x00010000 */
#define CSI_FCR0_CSPKTF                 CSI_FCR0_CSPKTF_Msk                      /*!< Clear Short packet flag */
#define CSI_FCR0_CCCFIFOFF_Pos          (21U)
#define CSI_FCR0_CCCFIFOFF_Msk          (0x1U << CSI_FCR0_CCCFIFOFF_Pos)         /*!< 0x00200000 */
#define CSI_FCR0_CCCFIFOFF              CSI_FCR0_CCCFIFOFF_Msk                   /*!< Clear Clock changer FIFO full flag */
#define CSI_FCR0_CCRCERRF_Pos           (24U)
#define CSI_FCR0_CCRCERRF_Msk           (0x1U << CSI_FCR0_CCRCERRF_Pos)          /*!< 0x01000000 */
#define CSI_FCR0_CCRCERRF               CSI_FCR0_CCRCERRF_Msk                    /*!< Clear CRC error flag */
#define CSI_FCR0_CECCERRF_Pos           (25U)
#define CSI_FCR0_CECCERRF_Msk           (0x1U << CSI_FCR0_CECCERRF_Pos)          /*!< 0x02000000 */
#define CSI_FCR0_CECCERRF               CSI_FCR0_CECCERRF_Msk                    /*!< Clear ECC error flag */
#define CSI_FCR0_CCECCERRF_Pos          (26U)
#define CSI_FCR0_CCECCERRF_Msk          (0x1U << CSI_FCR0_CCECCERRF_Pos)         /*!< 0x04000000 */
#define CSI_FCR0_CCECCERRF              CSI_FCR0_CCECCERRF_Msk                   /*!< Clear Corrected ECC error flag */
#define CSI_FCR0_CIDERRF_Pos            (27U)
#define CSI_FCR0_CIDERRF_Msk            (0x1U << CSI_FCR0_CIDERRF_Pos)           /*!< 0x08000000 */
#define CSI_FCR0_CIDERRF                CSI_FCR0_CIDERRF_Msk                     /*!< Clear Data type ID error flag */
#define CSI_FCR0_CSPKTERRF_Pos          (28U)
#define CSI_FCR0_CSPKTERRF_Msk          (0x1U << CSI_FCR0_CSPKTERRF_Pos)         /*!< 0x10000000 */
#define CSI_FCR0_CSPKTERRF              CSI_FCR0_CSPKTERRF_Msk                   /*!< Clear Short packet error flag */
#define CSI_FCR0_CWDERRF_Pos            (29U)
#define CSI_FCR0_CWDERRF_Msk            (0x1U << CSI_FCR0_CWDERRF_Pos)           /*!< 0x20000000 */
#define CSI_FCR0_CWDERRF                CSI_FCR0_CWDERRF_Msk                     /*!< Clear Watchdog error flag */
#define CSI_FCR0_CSYNCERRF_Pos          (30U)
#define CSI_FCR0_CSYNCERRF_Msk          (0x1U << CSI_FCR0_CSYNCERRF_Pos)         /*!< 0x40000000 */
#define CSI_FCR0_CSYNCERRF              CSI_FCR0_CSYNCERRF_Msk                   /*!< Clear Invalid synchronization error flag */

