STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_ca35.h
/******************  Bit definition for IPCC_C2SCR register  ******************/
#define IPCC_C2SCR_CH1C_Pos           (0U)
#define IPCC_C2SCR_CH1C_Msk           (0x1U << IPCC_C2SCR_CH1C_Pos)           /*!< 0x00000001 */
#define IPCC_C2SCR_CH1C               IPCC_C2SCR_CH1C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH2C_Pos           (1U)
#define IPCC_C2SCR_CH2C_Msk           (0x1U << IPCC_C2SCR_CH2C_Pos)           /*!< 0x00000002 */
#define IPCC_C2SCR_CH2C               IPCC_C2SCR_CH2C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH3C_Pos           (2U)
#define IPCC_C2SCR_CH3C_Msk           (0x1U << IPCC_C2SCR_CH3C_Pos)           /*!< 0x00000004 */
#define IPCC_C2SCR_CH3C               IPCC_C2SCR_CH3C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH4C_Pos           (3U)
#define IPCC_C2SCR_CH4C_Msk           (0x1U << IPCC_C2SCR_CH4C_Pos)           /*!< 0x00000008 */
#define IPCC_C2SCR_CH4C               IPCC_C2SCR_CH4C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH5C_Pos           (4U)
#define IPCC_C2SCR_CH5C_Msk           (0x1U << IPCC_C2SCR_CH5C_Pos)           /*!< 0x00000010 */
#define IPCC_C2SCR_CH5C               IPCC_C2SCR_CH5C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH6C_Pos           (5U)
#define IPCC_C2SCR_CH6C_Msk           (0x1U << IPCC_C2SCR_CH6C_Pos)           /*!< 0x00000020 */
#define IPCC_C2SCR_CH6C               IPCC_C2SCR_CH6C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH7C_Pos           (6U)
#define IPCC_C2SCR_CH7C_Msk           (0x1U << IPCC_C2SCR_CH7C_Pos)           /*!< 0x00000040 */
#define IPCC_C2SCR_CH7C               IPCC_C2SCR_CH7C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH8C_Pos           (7U)
#define IPCC_C2SCR_CH8C_Msk           (0x1U << IPCC_C2SCR_CH8C_Pos)           /*!< 0x00000080 */
#define IPCC_C2SCR_CH8C               IPCC_C2SCR_CH8C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH9C_Pos           (8U)
#define IPCC_C2SCR_CH9C_Msk           (0x1U << IPCC_C2SCR_CH9C_Pos)           /*!< 0x00000100 */
#define IPCC_C2SCR_CH9C               IPCC_C2SCR_CH9C_Msk                     /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH10C_Pos          (9U)
#define IPCC_C2SCR_CH10C_Msk          (0x1U << IPCC_C2SCR_CH10C_Pos)          /*!< 0x00000200 */
#define IPCC_C2SCR_CH10C              IPCC_C2SCR_CH10C_Msk                    /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH11C_Pos          (10U)
#define IPCC_C2SCR_CH11C_Msk          (0x1U << IPCC_C2SCR_CH11C_Pos)          /*!< 0x00000400 */
#define IPCC_C2SCR_CH11C              IPCC_C2SCR_CH11C_Msk                    /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH12C_Pos          (11U)
#define IPCC_C2SCR_CH12C_Msk          (0x1U << IPCC_C2SCR_CH12C_Pos)          /*!< 0x00000800 */
#define IPCC_C2SCR_CH12C              IPCC_C2SCR_CH12C_Msk                    /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH13C_Pos          (12U)
#define IPCC_C2SCR_CH13C_Msk          (0x1U << IPCC_C2SCR_CH13C_Pos)          /*!< 0x00001000 */
#define IPCC_C2SCR_CH13C              IPCC_C2SCR_CH13C_Msk                    /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH14C_Pos          (13U)
#define IPCC_C2SCR_CH14C_Msk          (0x1U << IPCC_C2SCR_CH14C_Pos)          /*!< 0x00002000 */
#define IPCC_C2SCR_CH14C              IPCC_C2SCR_CH14C_Msk                    /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH15C_Pos          (14U)
#define IPCC_C2SCR_CH15C_Msk          (0x1U << IPCC_C2SCR_CH15C_Pos)          /*!< 0x00004000 */
#define IPCC_C2SCR_CH15C              IPCC_C2SCR_CH15C_Msk                    /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH16C_Pos          (15U)
#define IPCC_C2SCR_CH16C_Msk          (0x1U << IPCC_C2SCR_CH16C_Pos)          /*!< 0x00008000 */
#define IPCC_C2SCR_CH16C              IPCC_C2SCR_CH16C_Msk                    /*!< Processor 2 receive channel n status clear */
#define IPCC_C2SCR_CH1S_Pos           (16U)
#define IPCC_C2SCR_CH1S_Msk           (0x1U << IPCC_C2SCR_CH1S_Pos)           /*!< 0x00010000 */
#define IPCC_C2SCR_CH1S               IPCC_C2SCR_CH1S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH2S_Pos           (17U)
#define IPCC_C2SCR_CH2S_Msk           (0x1U << IPCC_C2SCR_CH2S_Pos)           /*!< 0x00020000 */
#define IPCC_C2SCR_CH2S               IPCC_C2SCR_CH2S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH3S_Pos           (18U)
#define IPCC_C2SCR_CH3S_Msk           (0x1U << IPCC_C2SCR_CH3S_Pos)           /*!< 0x00040000 */
#define IPCC_C2SCR_CH3S               IPCC_C2SCR_CH3S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH4S_Pos           (19U)
#define IPCC_C2SCR_CH4S_Msk           (0x1U << IPCC_C2SCR_CH4S_Pos)           /*!< 0x00080000 */
#define IPCC_C2SCR_CH4S               IPCC_C2SCR_CH4S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH5S_Pos           (20U)
#define IPCC_C2SCR_CH5S_Msk           (0x1U << IPCC_C2SCR_CH5S_Pos)           /*!< 0x00100000 */
#define IPCC_C2SCR_CH5S               IPCC_C2SCR_CH5S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH6S_Pos           (21U)
#define IPCC_C2SCR_CH6S_Msk           (0x1U << IPCC_C2SCR_CH6S_Pos)           /*!< 0x00200000 */
#define IPCC_C2SCR_CH6S               IPCC_C2SCR_CH6S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH7S_Pos           (22U)
#define IPCC_C2SCR_CH7S_Msk           (0x1U << IPCC_C2SCR_CH7S_Pos)           /*!< 0x00400000 */
#define IPCC_C2SCR_CH7S               IPCC_C2SCR_CH7S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH8S_Pos           (23U)
#define IPCC_C2SCR_CH8S_Msk           (0x1U << IPCC_C2SCR_CH8S_Pos)           /*!< 0x00800000 */
#define IPCC_C2SCR_CH8S               IPCC_C2SCR_CH8S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH9S_Pos           (24U)
#define IPCC_C2SCR_CH9S_Msk           (0x1U << IPCC_C2SCR_CH9S_Pos)           /*!< 0x01000000 */
#define IPCC_C2SCR_CH9S               IPCC_C2SCR_CH9S_Msk                     /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH10S_Pos          (25U)
#define IPCC_C2SCR_CH10S_Msk          (0x1U << IPCC_C2SCR_CH10S_Pos)          /*!< 0x02000000 */
#define IPCC_C2SCR_CH10S              IPCC_C2SCR_CH10S_Msk                    /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH11S_Pos          (26U)
#define IPCC_C2SCR_CH11S_Msk          (0x1U << IPCC_C2SCR_CH11S_Pos)          /*!< 0x04000000 */
#define IPCC_C2SCR_CH11S              IPCC_C2SCR_CH11S_Msk                    /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH12S_Pos          (27U)
#define IPCC_C2SCR_CH12S_Msk          (0x1U << IPCC_C2SCR_CH12S_Pos)          /*!< 0x08000000 */
#define IPCC_C2SCR_CH12S              IPCC_C2SCR_CH12S_Msk                    /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH13S_Pos          (28U)
#define IPCC_C2SCR_CH13S_Msk          (0x1U << IPCC_C2SCR_CH13S_Pos)          /*!< 0x10000000 */
#define IPCC_C2SCR_CH13S              IPCC_C2SCR_CH13S_Msk                    /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH14S_Pos          (29U)
#define IPCC_C2SCR_CH14S_Msk          (0x1U << IPCC_C2SCR_CH14S_Pos)          /*!< 0x20000000 */
#define IPCC_C2SCR_CH14S              IPCC_C2SCR_CH14S_Msk                    /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH15S_Pos          (30U)
#define IPCC_C2SCR_CH15S_Msk          (0x1U << IPCC_C2SCR_CH15S_Pos)          /*!< 0x40000000 */
#define IPCC_C2SCR_CH15S              IPCC_C2SCR_CH15S_Msk                    /*!< Processor 2 transmit channel n status set */
#define IPCC_C2SCR_CH16S_Pos          (31U)
#define IPCC_C2SCR_CH16S_Msk          (0x1U << IPCC_C2SCR_CH16S_Pos)          /*!< 0x80000000 */
#define IPCC_C2SCR_CH16S              IPCC_C2SCR_CH16S_Msk                    /*!< Processor 2 transmit channel n status set */

