STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_ca35.h
/****************  Bit definition for OCTOSPI_WIR register  *******************/
#define OCTOSPI_WIR_INSTRUCTION_Pos    (0U)
#define OCTOSPI_WIR_INSTRUCTION_Msk    (0xFFFFFFFFU << OCTOSPI_WIR_INSTRUCTION_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WIR_INSTRUCTION        OCTOSPI_WIR_INSTRUCTION_Msk             /*!< Instruction */

/****************  Bit definition for OCTOSPI_WABR register  ******************/
#define OCTOSPI_WABR_ALTERNATE_Pos     (0U)
#define OCTOSPI_WABR_ALTERNATE_Msk     (0xFFFFFFFFU << OCTOSPI_WABR_ALTERNATE_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WABR_ALTERNATE         OCTOSPI_WABR_ALTERNATE_Msk              /*!< Alternate Bytes */

/****************  Bit definition for OCTOSPI_HLCR register  ******************/
#define OCTOSPI_HLCR_LM_Pos            (0U)
#define OCTOSPI_HLCR_LM_Msk            (0x1U << OCTOSPI_HLCR_LM_Pos)           /*!< 0x00000001 */
#define OCTOSPI_HLCR_LM                OCTOSPI_HLCR_LM_Msk                     /*!< Latency Mode */
#define OCTOSPI_HLCR_WZL_Pos           (1U)
#define OCTOSPI_HLCR_WZL_Msk           (0x1U << OCTOSPI_HLCR_WZL_Pos)          /*!< 0x00000002 */
#define OCTOSPI_HLCR_WZL               OCTOSPI_HLCR_WZL_Msk                    /*!< Write Zero Latency */
#define OCTOSPI_HLCR_TACC_Pos          (8U)
#define OCTOSPI_HLCR_TACC_Msk          (0xFFU << OCTOSPI_HLCR_TACC_Pos)        /*!< 0x0000FF00 */
#define OCTOSPI_HLCR_TACC              OCTOSPI_HLCR_TACC_Msk                   /*!< Access Time */
#define OCTOSPI_HLCR_TRWR_Pos          (16U)
#define OCTOSPI_HLCR_TRWR_Msk          (0xFFU << OCTOSPI_HLCR_TRWR_Pos)        /*!< 0x00FF0000 */
#define OCTOSPI_HLCR_TRWR              OCTOSPI_HLCR_TRWR_Msk                   /*!< Read Write Recovery Time */

/***************  Bit definition for OCTOSPI_HWCFGR2 register  ****************/
#define OCTOSPI_HWCFGR2_FRCK_Pos         (0U)
#define OCTOSPI_HWCFGR2_FRCK_Msk         (0xFU << OCTOSPI_HWCFGR2_FRCK_Pos)            /*!< 0x0000000F */
#define OCTOSPI_HWCFGR2_FRCK             OCTOSPI_HWCFGR2_FRCK_Msk                      /*!< Free running clock */
#define OCTOSPI_HWCFGR2_RDFT_Pos         (4U)
#define OCTOSPI_HWCFGR2_RDFT_Msk         (0xFU << OCTOSPI_HWCFGR2_RDFT_Pos)            /*!< 0x000000F0 */
#define OCTOSPI_HWCFGR2_RDFT             OCTOSPI_HWCFGR2_RDFT_Msk                      /*!< Reduced features */
#define OCTOSPI_HWCFGR2_ARBM_Pos         (8U)
#define OCTOSPI_HWCFGR2_ARBM_Msk         (0xFU << OCTOSPI_HWCFGR2_ARBM_Pos)            /*!< 0x00000F00 */
#define OCTOSPI_HWCFGR2_ARBM             OCTOSPI_HWCFGR2_ARBM_Msk                      /*!< Arbitration configuration */
#define OCTOSPI_HWCFGR2_MEM16_Pos        (12U)
#define OCTOSPI_HWCFGR2_MEM16_Msk        (0xFU << OCTOSPI_HWCFGR2_MEM16_Pos)           /*!< 0x0000F000 */
#define OCTOSPI_HWCFGR2_MEM16            OCTOSPI_HWCFGR2_MEM16_Msk                     /*!< Size of the SPI memory supported */
#define OCTOSPI_HWCFGR2_HSINT_Pos        (16U)
#define OCTOSPI_HWCFGR2_HSINT_Msk        (0xFU << OCTOSPI_HWCFGR2_HSINT_Pos)           /*!< 0x000F0000 */
#define OCTOSPI_HWCFGR2_HSINT            OCTOSPI_HWCFGR2_HSINT_Msk                     /*!< High-speed interface */

/****************  Bit definition for OCTOSPI_HWCFGR register  ****************/
#define OCTOSPI_HWCFGR_AXI_Pos           (0U)
#define OCTOSPI_HWCFGR_AXI_Msk           (0xFU << OCTOSPI_HWCFGR_AXI_Pos)              /*!< 0x0000000F */
#define OCTOSPI_HWCFGR_AXI               OCTOSPI_HWCFGR_AXI_Msk                        /*!< OCTOSPI interface */
#define OCTOSPI_HWCFGR_FIFO_Pos          (4U)
#define OCTOSPI_HWCFGR_FIFO_Msk          (0xFFU << OCTOSPI_HWCFGR_FIFO_Pos)            /*!< 0x00000FF0 */
#define OCTOSPI_HWCFGR_FIFO              OCTOSPI_HWCFGR_FIFO_Msk                       /*!< FIFO depth */
#define OCTOSPI_HWCFGR_PRES_Pos          (12U)
#define OCTOSPI_HWCFGR_PRES_Msk          (0xFFU << OCTOSPI_HWCFGR_PRES_Pos)            /*!< 0x000FF000 */
#define OCTOSPI_HWCFGR_PRES              OCTOSPI_HWCFGR_PRES_Msk                       /*!< Prescaler */
#define OCTOSPI_HWCFGR_IDL_Pos           (20U)
#define OCTOSPI_HWCFGR_IDL_Msk           (0xFU << OCTOSPI_HWCFGR_IDL_Pos)              /*!< 0x00F00000 */
#define OCTOSPI_HWCFGR_IDL               OCTOSPI_HWCFGR_IDL_Msk                        /*!< ID Length */
#define OCTOSPI_HWCFGR_MMW_Pos           (24U)
#define OCTOSPI_HWCFGR_MMW_Msk           (0xFU << OCTOSPI_HWCFGR_MMW_Pos)              /*!< 0x0F000000 */
#define OCTOSPI_HWCFGR_MMW               OCTOSPI_HWCFGR_MMW_Msk                        /*!< Memory-mapped write */
#define OCTOSPI_HWCFGR_CSSRV_Pos         (28U)
#define OCTOSPI_HWCFGR_CSSRV_Msk         (0xFU << OCTOSPI_HWCFGR_CSSRV_Pos)            /*!< 0xF0000000 */
#define OCTOSPI_HWCFGR_CSSRV             OCTOSPI_HWCFGR_CSSRV_Msk                      /*!< CSSEL reset value */

/****************  Bit definition for OCTOSPI_VER register  *******************/
#define OCTOSPI_VER_VER_Pos            (0U)
#define OCTOSPI_VER_VER_Msk            (0xFFU << OCTOSPI_VER_VER_Pos)          /*!< 0x000000FF */
#define OCTOSPI_VER_VER                OCTOSPI_VER_VER_Msk                     /*!< Version */

/*****************  Bit definition for OCTOSPI_ID register  *******************/
#define OCTOSPI_ID_ID_Pos              (0U)
#define OCTOSPI_ID_ID_Msk              (0xFFFFFFFFU << OCTOSPI_ID_ID_Pos)      /*!< 0xFFFFFFFF */
#define OCTOSPI_ID_ID                  OCTOSPI_ID_ID_Msk                       /*!< Identification */

/****************  Bit definition for OCTOSPI_MID register  *******************/
#define OCTOSPI_MID_MID_Pos            (0U)
#define OCTOSPI_MID_MID_Msk            (0xFFFFFFFFU << OCTOSPI_MID_MID_Pos)    /*!< 0xFFFFFFFF */
#define OCTOSPI_MID_MID                OCTOSPI_MID_MID_Msk                     /*!< Magic ID */


/******************************************************************************/
/*                                                                            */
/*                              On The Fly Decryption                         */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for OTFDEC_CR register  ******************/
#define OTFDEC_CR_ENC_Pos                      (0U)
#define OTFDEC_CR_ENC_Msk                      (0x1UL << OTFDEC_CR_ENC_Pos)                  /*!< 0x00000001 */
#define OTFDEC_CR_ENC                          OTFDEC_CR_ENC_Msk                             /*!< Encryption mode bit */

