STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_ca35.h
/* Bit fields for RCC_C1SREQSETR register */
#define RCC_C1SREQSETR_STPREQ_P0_Pos               (0U)
#define RCC_C1SREQSETR_STPREQ_P0_Msk               (0x1U << RCC_C1SREQSETR_STPREQ_P0_Pos)              /*!< 0x00000001 */
#define RCC_C1SREQSETR_STPREQ_P0                   RCC_C1SREQSETR_STPREQ_P0_Msk                      /*!< Stop request for CPU1 processor core 0 */
#define RCC_C1SREQSETR_ESLPREQ_Pos                 (16U)
#define RCC_C1SREQSETR_ESLPREQ_Msk                 (0x1U << RCC_C1SREQSETR_ESLPREQ_Pos)                /*!< 0x00010000 */
#define RCC_C1SREQSETR_ESLPREQ                   RCC_C1SREQSETR_ESLPREQ_Msk                        /*!< Enhanced CSleep request for CPU1 subsystem */

/* Bit fields for RCC_C1SREQCLRR register */
#define RCC_C1SREQCLRR_STPREQ_P0_Pos               (0U)
#define RCC_C1SREQCLRR_STPREQ_P0_Msk               (0x1U << RCC_C1SREQCLRR_STPREQ_P0_Pos)              /*!< 0x00000001 */
#define RCC_C1SREQCLRR_STPREQ_P0                   RCC_C1SREQCLRR_STPREQ_P0_Msk                      /*!< Stop request for CPU1 processor core 0 */
#define RCC_C1SREQCLRR_ESLPREQ_Pos                 (16U)
#define RCC_C1SREQCLRR_ESLPREQ_Msk                 (0x1U << RCC_C1SREQCLRR_ESLPREQ_Pos)                /*!< 0x00010000 */
#define RCC_C1SREQCLRR_ESLPREQ                   RCC_C1SREQCLRR_ESLPREQ_Msk                        /*!< Enhanced CSleep request for CPU1 subsystem */

/* Bit fields for RCC_CPUBOOTCR register */
#define RCC_CPUBOOTCR_BOOT_CPU2_Pos                (0U)
#define RCC_CPUBOOTCR_BOOT_CPU2_Msk                (0x1U << RCC_CPUBOOTCR_BOOT_CPU2_Pos)               /*!< 0x00000001 */
#define RCC_CPUBOOTCR_BOOT_CPU2                    RCC_CPUBOOTCR_BOOT_CPU2_Msk                       /*!< CPU2 to boot */
#define RCC_CPUBOOTCR_BOOT_CPU1_Pos                (1U)
#define RCC_CPUBOOTCR_BOOT_CPU1_Msk                (0x1U << RCC_CPUBOOTCR_BOOT_CPU1_Pos)               /*!< 0x00000002 */
#define RCC_CPUBOOTCR_BOOT_CPU1                    RCC_CPUBOOTCR_BOOT_CPU1_Msk                       /*!< CPU1 boot */

/* Bit fields for RCC_STBYBOOTCR register */
#define RCC_STBYBOOTCR_CPU_BEN_SEL_Pos             (1U)
#define RCC_STBYBOOTCR_CPU_BEN_SEL_Msk             (0x1U << RCC_STBYBOOTCR_CPU_BEN_SEL_Pos)            /*!< 0x00000002 */
#define RCC_STBYBOOTCR_CPU_BEN_SEL                 RCC_STBYBOOTCR_CPU_BEN_SEL_Msk                    /*!< CPU boot select */
#define RCC_STBYBOOTCR_COLD_CPU2_Pos               (2U)
#define RCC_STBYBOOTCR_COLD_CPU2_Msk               (0x1U << RCC_STBYBOOTCR_COLD_CPU2_Pos)              /*!< 0x00000004 */
#define RCC_STBYBOOTCR_COLD_CPU2                   RCC_STBYBOOTCR_COLD_CPU2_Msk                      /*!< CPU2 cold boot */
#define RCC_STBYBOOTCR_CPU2_HW_BEN_Pos             (4U)
#define RCC_STBYBOOTCR_CPU2_HW_BEN_Msk             (0x1U << RCC_STBYBOOTCR_CPU2_HW_BEN_Pos)            /*!< 0x00000010 */
#define RCC_STBYBOOTCR_CPU2_HW_BEN                 RCC_STBYBOOTCR_CPU2_HW_BEN_Msk                    /*!< CPU2 hardware boot enable */
#define RCC_STBYBOOTCR_CPU1_HW_BEN_Pos             (5U)
#define RCC_STBYBOOTCR_CPU1_HW_BEN_Msk             (0x1U << RCC_STBYBOOTCR_CPU1_HW_BEN_Pos)            /*!< 0x00000020 */
#define RCC_STBYBOOTCR_CPU1_HW_BEN                 RCC_STBYBOOTCR_CPU1_HW_BEN_Msk                    /*!< CPU1 hardware boot enable */
#define RCC_STBYBOOTCR_RET_CRCERR_RSTEN_Pos        (8U)
#define RCC_STBYBOOTCR_RET_CRCERR_RSTEN_Msk        (0x1U << RCC_STBYBOOTCR_RET_CRCERR_RSTEN_Pos)       /*!< 0x00000100 */
#define RCC_STBYBOOTCR_RET_CRCERR_RSTEN            RCC_STBYBOOTCR_RET_CRCERR_RSTEN_Msk                 /*!< RETRAM CRC error system reset enable */

/* Bit fields for RCC_LEGBOOTCR register */
#define RCC_LEGBOOTCR_LEGACY_BEN_Pos               (0U)
#define RCC_LEGBOOTCR_LEGACY_BEN_Msk               (0x1U << RCC_LEGBOOTCR_LEGACY_BEN_Pos)              /*!< 0x00000001 */
#define RCC_LEGBOOTCR_LEGACY_BEN                   RCC_LEGBOOTCR_LEGACY_BEN_Msk                      /*!< Enable of the legacy selection mode to choose the first CPU to boot */

/* Bit fields for RCC_BDCR register */
#define RCC_BDCR_LSEON_Pos                       (0U)
#define RCC_BDCR_LSEON_Msk                       (0x1U << RCC_BDCR_LSEON_Pos)                      /*!< 0x00000001 */
#define RCC_BDCR_LSEON                           RCC_BDCR_LSEON_Msk                                /*!< LSE oscillator enable */
#define RCC_BDCR_LSEBYP_Pos                      (1U)
#define RCC_BDCR_LSEBYP_Msk                      (0x1U << RCC_BDCR_LSEBYP_Pos)                     /*!< 0x00000002 */
#define RCC_BDCR_LSEBYP                          RCC_BDCR_LSEBYP_Msk                               /*!< LSE oscillator bypass */
#define RCC_BDCR_LSERDY_Pos                      (2U)
#define RCC_BDCR_LSERDY_Msk                      (0x1U << RCC_BDCR_LSERDY_Pos)                     /*!< 0x00000004 */
#define RCC_BDCR_LSERDY                          RCC_BDCR_LSERDY_Msk                               /*!< LSE oscillator ready */
#define RCC_BDCR_LSEDIGBYP_Pos                   (3U)
#define RCC_BDCR_LSEDIGBYP_Msk                   (0x1U << RCC_BDCR_LSEDIGBYP_Pos)                    /*!< 0x00000008 */
#define RCC_BDCR_LSEDIGBYP                       RCC_BDCR_LSEDIGBYP_Msk                            /*!< LSE digital bypass */
#define RCC_BDCR_LSEDRV_Pos                      (4U)
#define RCC_BDCR_LSEDRV_Msk                      (0x3U << RCC_BDCR_LSEDRV_Pos)                     /*!< 0x00000030 */
#define RCC_BDCR_LSEDRV                          RCC_BDCR_LSEDRV_Msk                               /*!< LSE oscillator driving capability */
#define RCC_BDCR_LSECSSON_Pos                    (6U)
#define RCC_BDCR_LSECSSON_Msk                    (0x1U << RCC_BDCR_LSECSSON_Pos)                   /*!< 0x00000040 */
#define RCC_BDCR_LSECSSON                        RCC_BDCR_LSECSSON_Msk                             /*!< LSE CSS enable */
#define RCC_BDCR_LSEGFON_Pos                     (7U)
#define RCC_BDCR_LSEGFON_Msk                     (0x1U << RCC_BDCR_LSEGFON_Pos)                    /*!< 0x00000080 */
#define RCC_BDCR_LSEGFON                         RCC_BDCR_LSEGFON_Msk                              /*!< LSE clock glitch filter enable */
#define RCC_BDCR_LSECSSD_Pos                     (8U)
#define RCC_BDCR_LSECSSD_Msk                     (0x1U << RCC_BDCR_LSECSSD_Pos)                    /*!< 0x00000100 */
#define RCC_BDCR_LSECSSD                         RCC_BDCR_LSECSSD_Msk                              /*!< LSE CSS failure detection */
#define RCC_BDCR_RTCSRC_Pos                      (16U)
#define RCC_BDCR_RTCSRC_Msk                      (0x3U << RCC_BDCR_RTCSRC_Pos)                     /*!< 0x00030000 */
#define RCC_BDCR_RTCSRC                          RCC_BDCR_RTCSRC_Msk                               /*!< RTC clock source selection */
#define RCC_BDCR_RTCCKEN_Pos                     (20U)
#define RCC_BDCR_RTCCKEN_Msk                     (0x1U << RCC_BDCR_RTCCKEN_Pos)                    /*!< 0x00100000 */
#define RCC_BDCR_RTCCKEN                         RCC_BDCR_RTCCKEN_Msk                              /*!< RTC clock enable */
#define RCC_BDCR_VSWRST_Pos                      (31U)
#define RCC_BDCR_VSWRST_Msk                      (0x1U << RCC_BDCR_VSWRST_Pos)                     /*!< 0x80000000 */
#define RCC_BDCR_VSWRST                          RCC_BDCR_VSWRST_Msk                               /*!< VSW domain software reset */

