STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_ca35.h
/* Bit fields for RCC_LPTIM1CFGR register */
#define RCC_LPTIM1CFGR_LPTIM1RST_Pos               (0U)
#define RCC_LPTIM1CFGR_LPTIM1RST_Msk               (0x1U << RCC_LPTIM1CFGR_LPTIM1RST_Pos)              /*!< 0x00000001 */
#define RCC_LPTIM1CFGR_LPTIM1RST                   RCC_LPTIM1CFGR_LPTIM1RST_Msk                      /*!< LPTIM1 reset */
#define RCC_LPTIM1CFGR_LPTIM1EN_Pos                (1U)
#define RCC_LPTIM1CFGR_LPTIM1EN_Msk                (0x1U << RCC_LPTIM1CFGR_LPTIM1EN_Pos)               /*!< 0x00000002 */
#define RCC_LPTIM1CFGR_LPTIM1EN                    RCC_LPTIM1CFGR_LPTIM1EN_Msk                       /*!< LPTIM1 clock enable */
#define RCC_LPTIM1CFGR_LPTIM1LPEN_Pos              (2U)
#define RCC_LPTIM1CFGR_LPTIM1LPEN_Msk              (0x1U << RCC_LPTIM1CFGR_LPTIM1LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPTIM1CFGR_LPTIM1LPEN                  RCC_LPTIM1CFGR_LPTIM1LPEN_Msk                     /*!< LPTIM1 clock enable during CSleep */

/* Bit fields for RCC_LPTIM2CFGR register */
#define RCC_LPTIM2CFGR_LPTIM2RST_Pos               (0U)
#define RCC_LPTIM2CFGR_LPTIM2RST_Msk               (0x1U << RCC_LPTIM2CFGR_LPTIM2RST_Pos)              /*!< 0x00000001 */
#define RCC_LPTIM2CFGR_LPTIM2RST                   RCC_LPTIM2CFGR_LPTIM2RST_Msk                      /*!< LPTIM2 reset */
#define RCC_LPTIM2CFGR_LPTIM2EN_Pos                (1U)
#define RCC_LPTIM2CFGR_LPTIM2EN_Msk                (0x1U << RCC_LPTIM2CFGR_LPTIM2EN_Pos)               /*!< 0x00000002 */
#define RCC_LPTIM2CFGR_LPTIM2EN                    RCC_LPTIM2CFGR_LPTIM2EN_Msk                       /*!< LPTIM2 clock enable */
#define RCC_LPTIM2CFGR_LPTIM2LPEN_Pos              (2U)
#define RCC_LPTIM2CFGR_LPTIM2LPEN_Msk              (0x1U << RCC_LPTIM2CFGR_LPTIM2LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPTIM2CFGR_LPTIM2LPEN                  RCC_LPTIM2CFGR_LPTIM2LPEN_Msk                     /*!< LPTIM2 clock enable during CSleep */

/* Bit fields for RCC_LPTIM3CFGR register */
#define RCC_LPTIM3CFGR_LPTIM3RST_Pos               (0U)
#define RCC_LPTIM3CFGR_LPTIM3RST_Msk               (0x1U << RCC_LPTIM3CFGR_LPTIM3RST_Pos)              /*!< 0x00000001 */
#define RCC_LPTIM3CFGR_LPTIM3RST                   RCC_LPTIM3CFGR_LPTIM3RST_Msk                      /*!< LPTIM3 reset */
#define RCC_LPTIM3CFGR_LPTIM3EN_Pos                (1U)
#define RCC_LPTIM3CFGR_LPTIM3EN_Msk                (0x1U << RCC_LPTIM3CFGR_LPTIM3EN_Pos)               /*!< 0x00000002 */
#define RCC_LPTIM3CFGR_LPTIM3EN                    RCC_LPTIM3CFGR_LPTIM3EN_Msk                       /*!< LPTIM3 clock enable */
#define RCC_LPTIM3CFGR_LPTIM3LPEN_Pos              (2U)
#define RCC_LPTIM3CFGR_LPTIM3LPEN_Msk              (0x1U << RCC_LPTIM3CFGR_LPTIM3LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPTIM3CFGR_LPTIM3LPEN                  RCC_LPTIM3CFGR_LPTIM3LPEN_Msk                     /*!< LPTIM3 clock enable during CSleep */

/* Bit fields for RCC_LPTIM4CFGR register */
#define RCC_LPTIM4CFGR_LPTIM4RST_Pos               (0U)
#define RCC_LPTIM4CFGR_LPTIM4RST_Msk               (0x1U << RCC_LPTIM4CFGR_LPTIM4RST_Pos)              /*!< 0x00000001 */
#define RCC_LPTIM4CFGR_LPTIM4RST                   RCC_LPTIM4CFGR_LPTIM4RST_Msk                      /*!< LPTIM4 reset */
#define RCC_LPTIM4CFGR_LPTIM4EN_Pos                (1U)
#define RCC_LPTIM4CFGR_LPTIM4EN_Msk                (0x1U << RCC_LPTIM4CFGR_LPTIM4EN_Pos)               /*!< 0x00000002 */
#define RCC_LPTIM4CFGR_LPTIM4EN                    RCC_LPTIM4CFGR_LPTIM4EN_Msk                       /*!< LPTIM4 clock enable */
#define RCC_LPTIM4CFGR_LPTIM4LPEN_Pos              (2U)
#define RCC_LPTIM4CFGR_LPTIM4LPEN_Msk              (0x1U << RCC_LPTIM4CFGR_LPTIM4LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPTIM4CFGR_LPTIM4LPEN                  RCC_LPTIM4CFGR_LPTIM4LPEN_Msk                     /*!< LPTIM4 clock enable during CSleep */

/* Bit fields for RCC_LPTIM5CFGR register */
#define RCC_LPTIM5CFGR_LPTIM5RST_Pos               (0U)
#define RCC_LPTIM5CFGR_LPTIM5RST_Msk               (0x1U << RCC_LPTIM5CFGR_LPTIM5RST_Pos)              /*!< 0x00000001 */
#define RCC_LPTIM5CFGR_LPTIM5RST                   RCC_LPTIM5CFGR_LPTIM5RST_Msk                      /*!< LPTIM5 reset */
#define RCC_LPTIM5CFGR_LPTIM5EN_Pos                (1U)
#define RCC_LPTIM5CFGR_LPTIM5EN_Msk                (0x1U << RCC_LPTIM5CFGR_LPTIM5EN_Pos)               /*!< 0x00000002 */
#define RCC_LPTIM5CFGR_LPTIM5EN                    RCC_LPTIM5CFGR_LPTIM5EN_Msk                       /*!< LPTIM5 clock enable */
#define RCC_LPTIM5CFGR_LPTIM5LPEN_Pos              (2U)
#define RCC_LPTIM5CFGR_LPTIM5LPEN_Msk              (0x1U << RCC_LPTIM5CFGR_LPTIM5LPEN_Pos)             /*!< 0x00000004 */
#define RCC_LPTIM5CFGR_LPTIM5LPEN                  RCC_LPTIM5CFGR_LPTIM5LPEN_Msk                     /*!< LPTIM5 clock enable during CSleep */

/* Bit fields for RCC_SPI1CFGR register */
#define RCC_SPI1CFGR_SPI1RST_Pos                   (0U)
#define RCC_SPI1CFGR_SPI1RST_Msk                   (0x1U << RCC_SPI1CFGR_SPI1RST_Pos)                  /*!< 0x00000001 */
#define RCC_SPI1CFGR_SPI1RST                       RCC_SPI1CFGR_SPI1RST_Msk                          /*!< SPI1 reset */
#define RCC_SPI1CFGR_SPI1EN_Pos                    (1U)
#define RCC_SPI1CFGR_SPI1EN_Msk                    (0x1U << RCC_SPI1CFGR_SPI1EN_Pos)                   /*!< 0x00000002 */
#define RCC_SPI1CFGR_SPI1EN                        RCC_SPI1CFGR_SPI1EN_Msk                           /*!< SPI1 clock enable */
#define RCC_SPI1CFGR_SPI1LPEN_Pos                  (2U)
#define RCC_SPI1CFGR_SPI1LPEN_Msk                  (0x1U << RCC_SPI1CFGR_SPI1LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SPI1CFGR_SPI1LPEN                      RCC_SPI1CFGR_SPI1LPEN_Msk                         /*!< SPI1 clock enable during CSleep */

/* Bit fields for RCC_SPI2CFGR register */
#define RCC_SPI2CFGR_SPI2RST_Pos                   (0U)
#define RCC_SPI2CFGR_SPI2RST_Msk                   (0x1U << RCC_SPI2CFGR_SPI2RST_Pos)                  /*!< 0x00000001 */
#define RCC_SPI2CFGR_SPI2RST                       RCC_SPI2CFGR_SPI2RST_Msk                          /*!< SPI2 reset */
#define RCC_SPI2CFGR_SPI2EN_Pos                    (1U)
#define RCC_SPI2CFGR_SPI2EN_Msk                    (0x1U << RCC_SPI2CFGR_SPI2EN_Pos)                   /*!< 0x00000002 */
#define RCC_SPI2CFGR_SPI2EN                        RCC_SPI2CFGR_SPI2EN_Msk                           /*!< SPI2 clock enable */
#define RCC_SPI2CFGR_SPI2LPEN_Pos                  (2U)
#define RCC_SPI2CFGR_SPI2LPEN_Msk                  (0x1U << RCC_SPI2CFGR_SPI2LPEN_Pos)                 /*!< 0x00000004 */
#define RCC_SPI2CFGR_SPI2LPEN                      RCC_SPI2CFGR_SPI2LPEN_Msk                         /*!< SPI2 clock enable during CSleep */

