STMicroelectronics/STM32PRGFW-UTIL/Drivers/CMSIS/Device/ST/STM32MP2xx/Include/stm32mp215fxx_ca35.h
/****************  Bit definition for USART_HWCFGR2 register  *****************/
#define USART_HWCFGR2_CFG1_Pos         (0U)
#define USART_HWCFGR2_CFG1_Msk         (0xFU << USART_HWCFGR2_CFG1_Pos)    /*!< 0x0000000F */
#define USART_HWCFGR2_CFG1             USART_HWCFGR2_CFG1_Msk      /*!< USART hardware configuration 1 */
#define USART_HWCFGR2_CFG2_Pos         (4U)
#define USART_HWCFGR2_CFG2_Msk         (0xFU << USART_HWCFGR2_CFG2_Pos)    /*!< 0x000000F0 */
#define USART_HWCFGR2_CFG2             USART_HWCFGR2_CFG2_Msk      /*!< USART hardware configuration 2 */
#define USART_HWCFGR2_CFG3_Pos         (8U)
#define USART_HWCFGR2_CFG3_Msk         (0xFU << USART_HWCFGR2_CFG3_Pos)    /*!< 0x00000F00 */
#define USART_HWCFGR2_CFG3             USART_HWCFGR2_CFG3_Msk      /*!< USART hardware configuration 3 */

/****************  Bit definition for USART_HWCFGR1 register  *****************/
#define USART_HWCFGR1_CFG1_Pos         (0U)
#define USART_HWCFGR1_CFG1_Msk         (0xFU << USART_HWCFGR1_CFG1_Pos)    /*!< 0x0000000F */
#define USART_HWCFGR1_CFG1             USART_HWCFGR1_CFG1_Msk      /*!< USART hardware configuration 1 */
#define USART_HWCFGR1_CFG2_Pos         (4U)
#define USART_HWCFGR1_CFG2_Msk         (0xFU << USART_HWCFGR1_CFG2_Pos)    /*!< 0x000000F0 */
#define USART_HWCFGR1_CFG2             USART_HWCFGR1_CFG2_Msk      /*!< USART hardware configuration 2 */
#define USART_HWCFGR1_CFG3_Pos         (8U)
#define USART_HWCFGR1_CFG3_Msk         (0xFU << USART_HWCFGR1_CFG3_Pos)    /*!< 0x00000F00 */
#define USART_HWCFGR1_CFG3             USART_HWCFGR1_CFG3_Msk      /*!< USART hardware configuration 3 */
#define USART_HWCFGR1_CFG4_Pos         (12U)
#define USART_HWCFGR1_CFG4_Msk         (0xFU << USART_HWCFGR1_CFG4_Pos)    /*!< 0x0000F000 */
#define USART_HWCFGR1_CFG4             USART_HWCFGR1_CFG4_Msk      /*!< USART hardware configuration 4 */
#define USART_HWCFGR1_CFG5_Pos         (16U)
#define USART_HWCFGR1_CFG5_Msk         (0xFU << USART_HWCFGR1_CFG5_Pos)    /*!< 0x000F0000 */
#define USART_HWCFGR1_CFG5             USART_HWCFGR1_CFG5_Msk      /*!< USART hardware configuration 5 */
#define USART_HWCFGR1_CFG6_Pos         (20U)
#define USART_HWCFGR1_CFG6_Msk         (0xFU << USART_HWCFGR1_CFG6_Pos)    /*!< 0x00F00000 */
#define USART_HWCFGR1_CFG6             USART_HWCFGR1_CFG6_Msk      /*!< USART hardware configuration 6 */
#define USART_HWCFGR1_CFG7_Pos         (24U)
#define USART_HWCFGR1_CFG7_Msk         (0xFU << USART_HWCFGR1_CFG7_Pos)    /*!< 0x0F000000 */
#define USART_HWCFGR1_CFG7             USART_HWCFGR1_CFG7_Msk      /*!< USART hardware configuration 7 */
#define USART_HWCFGR1_CFG8_Pos         (28U)
#define USART_HWCFGR1_CFG8_Msk         (0xFU << USART_HWCFGR1_CFG8_Pos)    /*!< 0xF0000000 */
#define USART_HWCFGR1_CFG8             USART_HWCFGR1_CFG8_Msk      /*!< USART hardware configuration 8  */

/******************  Bit definition for USART_VERR register  ******************/
#define USART_VERR_MINREV_Pos          (0U)
#define USART_VERR_MINREV_Msk          (0xFU << USART_VERR_MINREV_Pos)   /*!< 0x0000000F */
#define USART_VERR_MINREV              USART_VERR_MINREV_Msk       /*!< Minor revision */
#define USART_VERR_MAJREV_Pos          (4U)
#define USART_VERR_MAJREV_Msk          (0xFU << USART_VERR_MAJREV_Pos)   /*!< 0x000000F0 */
#define USART_VERR_MAJREV              USART_VERR_MAJREV_Msk       /*!< Major revision */

/*****************  Bit definition for USART_IPIDR register  ******************/
#define USART_IPIDR_ID_Pos             (0U)
#define USART_IPIDR_ID_Msk             (0xFFFFFFFFU << USART_IPIDR_ID_Pos)       /*!< 0xFFFFFFFF */
#define USART_IPIDR_ID                 USART_IPIDR_ID_Msk          /*!< Peripheral identifier */

/******************  Bit definition for USART_SIDR register  ******************/
#define USART_SIDR_SID_Pos             (0U)
#define USART_SIDR_SID_Msk             (0xFFFFFFFFU << USART_SIDR_SID_Pos)       /*!< 0xFFFFFFFF */
#define USART_SIDR_SID                 USART_SIDR_SID_Msk          /*!< Size identification  */

/******************************************************************************/
/*                                                                            */
/*                                       USB_OTG                              */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for USB_OTG_GOTGCTL register  ********************/
#define USB_OTG_GOTGCTL_SRQSCS_Pos               (0U)
#define USB_OTG_GOTGCTL_SRQSCS_Msk               (0x1U << USB_OTG_GOTGCTL_SRQSCS_Pos)      /*!< 0x00000001 */
#define USB_OTG_GOTGCTL_SRQSCS                   USB_OTG_GOTGCTL_SRQSCS_Msk                /*!< Session request success */
#define USB_OTG_GOTGCTL_SRQ_Pos                  (1U)
#define USB_OTG_GOTGCTL_SRQ_Msk                  (0x1U << USB_OTG_GOTGCTL_SRQ_Pos)         /*!< 0x00000002 */
#define USB_OTG_GOTGCTL_SRQ                      USB_OTG_GOTGCTL_SRQ_Msk                   /*!< Session request */
#define USB_OTG_GOTGCTL_VBVALOEN_Pos             (2U)
#define USB_OTG_GOTGCTL_VBVALOEN_Msk             (0x1U << USB_OTG_GOTGCTL_VBVALOEN_Pos)    /*!< 0x00000004 */
#define USB_OTG_GOTGCTL_VBVALOEN                 USB_OTG_GOTGCTL_VBVALOEN_Msk              /*!< VBUS valid override enable */
#define USB_OTG_GOTGCTL_VBVALOVAL_Pos            (3U)
#define USB_OTG_GOTGCTL_VBVALOVAL_Msk            (0x1U << USB_OTG_GOTGCTL_VBVALOVAL_Pos)   /*!< 0x00000008 */
#define USB_OTG_GOTGCTL_VBVALOVAL                USB_OTG_GOTGCTL_VBVALOVAL_Msk             /*!< VBUS valid override value */
#define USB_OTG_GOTGCTL_AVALOEN_Pos              (4U)
#define USB_OTG_GOTGCTL_AVALOEN_Msk              (0x1U << USB_OTG_GOTGCTL_AVALOEN_Pos)     /*!< 0x00000010 */
#define USB_OTG_GOTGCTL_AVALOEN                  USB_OTG_GOTGCTL_AVALOEN_Msk               /*!< A-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_AVALOVAL_Pos             (5U)
#define USB_OTG_GOTGCTL_AVALOVAL_Msk             (0x1U << USB_OTG_GOTGCTL_AVALOVAL_Pos)    /*!< 0x00000020 */
#define USB_OTG_GOTGCTL_AVALOVAL                 USB_OTG_GOTGCTL_AVALOVAL_Msk              /*!< A-peripheral session valid override value */
#define USB_OTG_GOTGCTL_BVALOEN_Pos              (6U)
#define USB_OTG_GOTGCTL_BVALOEN_Msk              (0x1U << USB_OTG_GOTGCTL_BVALOEN_Pos)     /*!< 0x00000040 */
#define USB_OTG_GOTGCTL_BVALOEN                  USB_OTG_GOTGCTL_BVALOEN_Msk               /*!< B-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_BVALOVAL_Pos             (7U)
#define USB_OTG_GOTGCTL_BVALOVAL_Msk             (0x1U << USB_OTG_GOTGCTL_BVALOVAL_Pos)    /*!< 0x00000080 */
#define USB_OTG_GOTGCTL_BVALOVAL                 USB_OTG_GOTGCTL_BVALOVAL_Msk              /*!< B-peripheral session valid override value  */
#define USB_OTG_GOTGCTL_BSESVLD_Pos              (19U)
#define USB_OTG_GOTGCTL_BSESVLD_Msk              (0x1U << USB_OTG_GOTGCTL_BSESVLD_Pos)     /*!< 0x00080000 */
#define USB_OTG_GOTGCTL_BSESVLD                  USB_OTG_GOTGCTL_BSESVLD_Msk               /*!<  B-session valid*/

/********************  Bit definition for USB_OTG_HCFG register  ********************/
#define USB_OTG_HCFG_FSLSPCS_Pos                 (0U)
#define USB_OTG_HCFG_FSLSPCS_Msk                 (0x3U << USB_OTG_HCFG_FSLSPCS_Pos)        /*!< 0x00000003 */
#define USB_OTG_HCFG_FSLSPCS                     USB_OTG_HCFG_FSLSPCS_Msk                  /*!< FS/LS PHY clock select */
#define USB_OTG_HCFG_FSLSPCS_0                   (0x1U << USB_OTG_HCFG_FSLSPCS_Pos)        /*!< 0x00000001 */
#define USB_OTG_HCFG_FSLSPCS_1                   (0x2U << USB_OTG_HCFG_FSLSPCS_Pos)        /*!< 0x00000002 */
#define USB_OTG_HCFG_FSLSS_Pos                   (2U)
#define USB_OTG_HCFG_FSLSS_Msk                   (0x1U << USB_OTG_HCFG_FSLSS_Pos)          /*!< 0x00000004 */
#define USB_OTG_HCFG_FSLSS                       USB_OTG_HCFG_FSLSS_Msk                    /*!< FS- and LS-only support */

/********************  Bit definition for USB_OTG_DCFG register  ********************/
#define USB_OTG_DCFG_DSPD_Pos                    (0U)
#define USB_OTG_DCFG_DSPD_Msk                    (0x3U << USB_OTG_DCFG_DSPD_Pos)           /*!< 0x00000003 */
#define USB_OTG_DCFG_DSPD                        USB_OTG_DCFG_DSPD_Msk                     /*!< Device speed */
#define USB_OTG_DCFG_DSPD_0                      (0x1U << USB_OTG_DCFG_DSPD_Pos)           /*!< 0x00000001 */
#define USB_OTG_DCFG_DSPD_1                      (0x2U << USB_OTG_DCFG_DSPD_Pos)           /*!< 0x00000002 */
#define USB_OTG_DCFG_NZLSOHSK_Pos                (2U)
#define USB_OTG_DCFG_NZLSOHSK_Msk                (0x1U << USB_OTG_DCFG_NZLSOHSK_Pos)       /*!< 0x00000004 */
#define USB_OTG_DCFG_NZLSOHSK                    USB_OTG_DCFG_NZLSOHSK_Msk                 /*!< Nonzero-length status OUT handshake */
#define USB_OTG_DCFG_DAD_Pos                     (4U)
#define USB_OTG_DCFG_DAD_Msk                     (0x7FU << USB_OTG_DCFG_DAD_Pos)           /*!< 0x000007F0 */
#define USB_OTG_DCFG_DAD                         USB_OTG_DCFG_DAD_Msk                      /*!< Device address */
#define USB_OTG_DCFG_DAD_0                       (0x01U << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000010 */
#define USB_OTG_DCFG_DAD_1                       (0x02U << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000020 */
#define USB_OTG_DCFG_DAD_2                       (0x04U << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000040 */
#define USB_OTG_DCFG_DAD_3                       (0x08U << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000080 */
#define USB_OTG_DCFG_DAD_4                       (0x10U << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000100 */
#define USB_OTG_DCFG_DAD_5                       (0x20U << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000200 */
#define USB_OTG_DCFG_DAD_6                       (0x40U << USB_OTG_DCFG_DAD_Pos)           /*!< 0x00000400 */
#define USB_OTG_DCFG_PFIVL_Pos                   (11U)
#define USB_OTG_DCFG_PFIVL_Msk                   (0x3U << USB_OTG_DCFG_PFIVL_Pos)          /*!< 0x00001800 */
#define USB_OTG_DCFG_PFIVL                       USB_OTG_DCFG_PFIVL_Msk                    /*!< Periodic (micro)frame interval */
#define USB_OTG_DCFG_PFIVL_0                     (0x1U << USB_OTG_DCFG_PFIVL_Pos)          /*!< 0x00000800 */
#define USB_OTG_DCFG_PFIVL_1                     (0x2U << USB_OTG_DCFG_PFIVL_Pos)          /*!< 0x00001000 */
#define USB_OTG_DCFG_PERSCHIVL_Pos               (24U)
#define USB_OTG_DCFG_PERSCHIVL_Msk               (0x3U << USB_OTG_DCFG_PERSCHIVL_Pos)      /*!< 0x03000000 */
#define USB_OTG_DCFG_PERSCHIVL                   USB_OTG_DCFG_PERSCHIVL_Msk                /*!< Periodic scheduling interval */
#define USB_OTG_DCFG_PERSCHIVL_0                 (0x1U << USB_OTG_DCFG_PERSCHIVL_Pos)      /*!< 0x01000000 */
#define USB_OTG_DCFG_PERSCHIVL_1                 (0x2U << USB_OTG_DCFG_PERSCHIVL_Pos)      /*!< 0x02000000 */

/********************  Bit definition for USB_OTG_PCGCR register  ********************/
#define USB_OTG_PCGCR_STPPCLK_Pos                (0U)
#define USB_OTG_PCGCR_STPPCLK_Msk                (0x1U << USB_OTG_PCGCR_STPPCLK_Pos)       /*!< 0x00000001 */
#define USB_OTG_PCGCR_STPPCLK                    USB_OTG_PCGCR_STPPCLK_Msk                 /*!< Stop PHY clock */
#define USB_OTG_PCGCR_GATEHCLK_Pos               (1U)
#define USB_OTG_PCGCR_GATEHCLK_Msk               (0x1U << USB_OTG_PCGCR_GATEHCLK_Pos)      /*!< 0x00000002 */
#define USB_OTG_PCGCR_GATEHCLK                   USB_OTG_PCGCR_GATEHCLK_Msk                /*!< Gate HCLK */
#define USB_OTG_PCGCR_PHYSUSP_Pos                (4U)
#define USB_OTG_PCGCR_PHYSUSP_Msk                (0x1U << USB_OTG_PCGCR_PHYSUSP_Pos)       /*!< 0x00000010 */
#define USB_OTG_PCGCR_PHYSUSP                    USB_OTG_PCGCR_PHYSUSP_Msk                 /*!< PHY suspended */

